Feature: augmented trilateral verb conjugation

  Scenario Outline: active augmented trilateral verb past conjugation
    Given an augmented verb
    When the verb is conjugated
    Then the first person singular conjugation of the verb "<verb>" and formula of "<formula>" is "<single_first>"
    And the first person plural conjugation of the verb "<verb>" and formula of "<formula>" is "<plural_first>"
    And the masculine singular second person conjugation of the verb "<verb>" and formula of "<formula>" is "<m_single_second>"
    And the feminine singular second person conjugation of the verb "<verb>" and formula of "<formula>" is "<f_single_second>"
    And the masculine dual second person conjugation of the verb "<verb>" and formula of "<formula>" is "<m_dual_second>"
    And the masculine plural second person conjugation of the verb "<verb>" and formula of "<formula>" is "<m_plural_second>"
    And the feminine plural second person conjugation of the verb "<verb>" and formula of "<formula>" is "<f_plural_second>"
    And the masculine singular third person conjugation of the verb "<verb>" and formula of "<formula>" is "<m_single_third>"
    And the feminine singular third person conjugation of the verb "<verb>" and formula of "<formula>" is "<f_single_third>"
    And the masculine dual third person conjugation of the verb "<verb>" and formula of "<formula>" is "<m_dual_third>"
    And the feminine dual third person conjugation of the verb "<verb>" and formula of "<formula>" is "<f_dual_third>"
    And the masculine plural third person conjugation of the verb "<verb>" and formula of "<formula>" is "<m_plural_third>"
    And the feminine plural third person conjugation of the verb "<verb>" and formula of "<formula>" is "<f_plural_third>"
    Examples:
      | verb | formula | single_first  | plural_first   | m_single_second | f_single_second | m_dual_second    | m_plural_second | f_plural_second  | m_single_third | f_single_third | m_dual_third | f_dual_third   | m_plural_third | f_plural_third |
      | ءتي | 1 | آتَيْتُ | آتَيْنَا | آتَيْتَ | آتَيْتِ | آتَيْتُمَا | آتَيْتُمْ | آتَيْتُنَّ | آتَى | آتَتْ | آتَيَا | آتَتَا | آتَوْا | آتَيْنَ |
      | ءتي | 2 | أَتَّيْتُ | أَتَّيْنَا | أَتَّيْتَ | أَتَّيْتِ | أَتَّيْتُمَا | أَتَّيْتُمْ | أَتَّيْتُنَّ | أَتَّى | أَتَّتْ | أَتَّيَا | أَتَّتَا | أَتَّوْا | أَتَّيْنَ |
      | ءتي | 8 | تَأَتَّيْتُ | تَأَتَّيْنَا | تَأَتَّيْتَ | تَأَتَّيْتِ | تَأَتَّيْتُمَا | تَأَتَّيْتُمْ | تَأَتَّيْتُنَّ | تَأَتَّى | تَأَتَّتْ | تَأَتَّيَا | تَأَتَّتَا | تَأَتَّوْا | تَأَتَّيْنَ |
      | ءتي | 9 | اسْتَأْتَيْتُ | اسْتَأْتَيْنَا | اسْتَأْتَيْتَ | اسْتَأْتَيْتِ | اسْتَأْتَيْتُمَا | اسْتَأْتَيْتُمْ | اسْتَأْتَيْتُنَّ | اسْتَأْتَى | اسْتَأْتَتْ | اسْتَأْتَيَا | اسْتَأْتَتَا | اسْتَأْتَوْا | اسْتَأْتَيْنَ |
      | ءدي | 1 | آدَيْتُ | آدَيْنَا | آدَيْتَ | آدَيْتِ | آدَيْتُمَا | آدَيْتُمْ | آدَيْتُنَّ | آدَى | آدَتْ | آدَيَا | آدَتَا | آدَوْا | آدَيْنَ |
      | ءدي | 2 | أَدَّيْتُ | أَدَّيْنَا | أَدَّيْتَ | أَدَّيْتِ | أَدَّيْتُمَا | أَدَّيْتُمْ | أَدَّيْتُنَّ | أَدَّى | أَدَّتْ | أَدَّيَا | أَدَّتَا | أَدَّوْا | أَدَّيْنَ |
      | ءدي | 7 | تَآدَيْتُ | تَآدَيْنَا | تَآدَيْتَ | تَآدَيْتِ | تَآدَيْتُمَا | تَآدَيْتُمْ | تَآدَيْتُنَّ | تَآدَى | تَآدَتْ | تَآدَيَا | تَآدَتَا | تَآدَوْا | تَآدَيْنَ |
      | ءدي | 8 | تَأَدَّيْتُ | تَأَدَّيْنَا | تَأَدَّيْتَ | تَأَدَّيْتِ | تَأَدَّيْتُمَا | تَأَدَّيْتُمْ | تَأَدَّيْتُنَّ | تَأَدَّى | تَأَدَّتْ | تَأَدَّيَا | تَأَدَّتَا | تَأَدَّوْا | تَأَدَّيْنَ |
      | ءدي | 9 | اسْتَأْدَيْتُ | اسْتَأْدَيْنَا | اسْتَأْدَيْتَ | اسْتَأْدَيْتِ | اسْتَأْدَيْتُمَا | اسْتَأْدَيْتُمْ | اسْتَأْدَيْتُنَّ | اسْتَأْدَى | اسْتَأْدَتْ | اسْتَأْدَيَا | اسْتَأْدَتَا | اسْتَأْدَوْا | اسْتَأْدَيْنَ |
      | ءجر | 1 | آجَرْتُ | آجَرْنَا | آجَرْتَ | آجَرْتِ | آجَرْتُمَا | آجَرْتُمْ | آجَرْتُنَّ | آجَرَ | آجَرَتْ | آجَرَا | آجَرَتَا | آجَرُوا | آجَرْنَ |
      | ءجر | 3 | آجَرْتُ | آجَرْنَا | آجَرْتَ | آجَرْتِ | آجَرْتُمَا | آجَرْتُمْ | آجَرْتُنَّ | آجَرَ | آجَرَتْ | آجَرَا | آجَرَتَا | آجَرُوا | آجَرْنَ |
      | ءجر | 5 | ائْتَجَرْتُ | ائْتَجَرْنَا | ائْتَجَرْتَ | ائْتَجَرْتِ | ائْتَجَرْتُمَا | ائْتَجَرْتُمْ | ائْتَجَرْتُنَّ | ائْتَجَرَ | ائْتَجَرَتْ | ائْتَجَرَا | ائْتَجَرَتَا | ائْتَجَرُوا | ائْتَجَرْنَ |
      | ءجر | 9 | اسْتَأْجَرْتُ | اسْتَأْجَرْنَا | اسْتَأْجَرْتَ | اسْتَأْجَرْتِ | اسْتَأْجَرْتُمَا | اسْتَأْجَرْتُمْ | اسْتَأْجَرْتُنَّ | اسْتَأْجَرَ | اسْتَأْجَرَتْ | اسْتَأْجَرَا | اسْتَأْجَرَتَا | اسْتَأْجَرُوا | اسْتَأْجَرْنَ |
      | بيض | 1 | أَبَضْتُ | أَبَضْنَا | أَبَضْتَ | أَبَضْتِ | أَبَضْتُمَا | أَبَضْتُمْ | أَبَضْتُنَّ | أَبَاضَ | أَبَاضَتْ | أَبَاضَا | أَبَاضَتَا | أَبَاضُوا | أَبَضْنَ |
      | بيض | 12 | ابْيَاضَضْتُ | ابْيَاضَضْنَا | ابْيَاضَضْتَ | ابْيَاضَضْتِ | ابْيَاضَضْتُمَا | ابْيَاضَضْتُمْ | ابْيَاضَضْتُنَّ | ابْيَاضَّ | ابْيَاضَّتْ | ابْيَاضَّا | ابْيَاضَّتَا | ابْيَاضُّوا | ابْيَاضَضْنَ |
      | بيض | 2 | بَيَّضْتُ | بَيَّضْنَا | بَيَّضْتَ | بَيَّضْتِ | بَيَّضْتُمَا | بَيَّضْتُمْ | بَيَّضْتُنَّ | بَيَّضَ | بَيَّضَتْ | بَيَّضَا | بَيَّضَتَا | بَيَّضُوا | بَيَّضْنَ |
      | بيض | 3 | بَايَضْتُ | بَايَضْنَا | بَايَضْتَ | بَايَضْتِ | بَايَضْتُمَا | بَايَضْتُمْ | بَايَضْتُنَّ | بَايَضَ | بَايَضَتْ | بَايَضَا | بَايَضَتَا | بَايَضُوا | بَايَضْنَ |
      | بيض | 5 | ابْتَضْتُ | ابْتَضْنَا | ابْتَضْتَ | ابْتَضْتِ | ابْتَضْتُمَا | ابْتَضْتُمْ | ابْتَضْتُنَّ | ابْتَاضَ | ابْتَاضَتْ | ابْتَاضَا | ابْتَاضَتَا | ابْتَاضُوا | ابْتَضْنَ |
      | بيض | 6 | ابْيَضَضْتُ | ابْيَضَضْنَا | ابْيَضَضْتَ | ابْيَضَضْتِ | ابْيَضَضْتُمَا | ابْيَضَضْتُمْ | ابْيَضَضْتُنَّ | ابْيَضَّ | ابْيَضَّتْ | ابْيَضَّا | ابْيَضَّتَا | ابْيَضُّوا | ابْيَضَضْنَ |
      | بيض | 9 | اسْتَبَضْتُ | اسْتَبَضْنَا | اسْتَبَضْتَ | اسْتَبَضْتِ | اسْتَبَضْتُمَا | اسْتَبَضْتُمْ | اسْتَبَضْتُنَّ | اسْتَبَاضَ | اسْتَبَاضَتْ | اسْتَبَاضَا | اسْتَبَاضَتَا | اسْتَبَاضُوا | اسْتَبَضْنَ |
      | ءكل | 1 | آكَلْتُ | آكَلْنَا | آكَلْتَ | آكَلْتِ | آكَلْتُمَا | آكَلْتُمْ | آكَلْتُنَّ | آكَلَ | آكَلَتْ | آكَلا | آكَلَتَا | آكَلُوا | آكَلْنَ |
      | ءكل | 2 | أَكَّلْتُ | أَكَّلْنَا | أَكَّلْتَ | أَكَّلْتِ | أَكَّلْتُمَا | أَكَّلْتُمْ | أَكَّلْتُنَّ | أَكَّلَ | أَكَّلَتْ | أَكَّلا | أَكَّلَتَا | أَكَّلُوا | أَكَّلْنَ |
      | ءكل | 3 | آكَلْتُ | آكَلْنَا | آكَلْتَ | آكَلْتِ | آكَلْتُمَا | آكَلْتُمْ | آكَلْتُنَّ | آكَلَ | آكَلَتْ | آكَلا | آكَلَتَا | آكَلُوا | آكَلْنَ |
      | ءكل | 5 | ائْتَكَلْتُ | ائْتَكَلْنَا | ائْتَكَلْتَ | ائْتَكَلْتِ | ائْتَكَلْتُمَا | ائْتَكَلْتُمْ | ائْتَكَلْتُنَّ | ائْتَكَلَ | ائْتَكَلَتْ | ائْتَكَلا | ائْتَكَلَتَا | ائْتَكَلُوا | ائْتَكَلْنَ |
      | ءكل | 7 | تَآكَلْتُ | تَآكَلْنَا | تَآكَلْتَ | تَآكَلْتِ | تَآكَلْتُمَا | تَآكَلْتُمْ | تَآكَلْتُنَّ | تَآكَلَ | تَآكَلَتْ | تَآكَلا | تَآكَلَتَا | تَآكَلُوا | تَآكَلْنَ |
      | ءكل | 8 | تَأَكَّلْتُ | تَأَكَّلْنَا | تَأَكَّلْتَ | تَأَكَّلْتِ | تَأَكَّلْتُمَا | تَأَكَّلْتُمْ | تَأَكَّلْتُنَّ | تَأَكَّلَ | تَأَكَّلَتْ | تَأَكَّلا | تَأَكَّلَتَا | تَأَكَّلُوا | تَأَكَّلْنَ |
      | ءكل | 9 | اسْتَأْكَلْتُ | اسْتَأْكَلْنَا | اسْتَأْكَلْتَ | اسْتَأْكَلْتِ | اسْتَأْكَلْتُمَا | اسْتَأْكَلْتُمْ | اسْتَأْكَلْتُنَّ | اسْتَأْكَلَ | اسْتَأْكَلَتْ | اسْتَأْكَلا | اسْتَأْكَلَتَا | اسْتَأْكَلُوا | اسْتَأْكَلْنَ |
      | جءل | 6 | اجْأَلَلْتُ | اجْأَلَلْنَا | اجْأَلَلْتَ | اجْأَلَلْتِ | اجْأَلَلْتُمَا | اجْأَلَلْتُمْ | اجْأَلَلْتُنَّ | اجْأَلَّ | اجْأَلَّتْ | اجْأَلاَّ | اجْأَلَّتَا | اجْأَلُّوا | اجْأَلَلْنَ |
      | ءبن | 2 | أَبَّنْتُ | أَبَّنَّا | أَبَّنْتَ | أَبَّنْتِ | أَبَّنْتُمَا | أَبَّنْتُمْ | أَبَّنْتُنَّ | أَبَّنَ | أَبَّنَتْ | أَبَّنَا | أَبَّنَتَا | أَبَّنُوا | أَبَّنَّ |
      | ءبن | 8 | تَأَبَّنْتُ | تَأَبَّنَّا | تَأَبَّنْتَ | تَأَبَّنْتِ | تَأَبَّنْتُمَا | تَأَبَّنْتُمْ | تَأَبَّنْتُنَّ | تَأَبَّنَ | تَأَبَّنَتْ | تَأَبَّنَا | تَأَبَّنَتَا | تَأَبَّنُوا | تَأَبَّنَّ |
      | ءذن | 1 | آذَنْتُ | آذَنَّا | آذَنْتَ | آذَنْتِ | آذَنْتُمَا | آذَنْتُمْ | آذَنْتُنَّ | آذَنَ | آذَنَتْ | آذَنَا | آذَنَتَا | آذَنُوا | آذَنَّ |
      | ءذن | 2 | أَذَّنْتُ | أَذَّنَّا | أَذَّنْتَ | أَذَّنْتِ | أَذَّنْتُمَا | أَذَّنْتُمْ | أَذَّنْتُنَّ | أَذَّنَ | أَذَّنَتْ | أَذَّنَا | أَذَّنَتَا | أَذَّنُوا | أَذَّنَّ |
      | ءذن | 8 | تَأَذَّنْتُ | تَأَذَّنَّا | تَأَذَّنْتَ | تَأَذَّنْتِ | تَأَذَّنْتُمَا | تَأَذَّنْتُمْ | تَأَذَّنْتُنَّ | تَأَذَّنَ | تَأَذَّنَتْ | تَأَذَّنَا | تَأَذَّنَتَا | تَأَذَّنُوا | تَأَذَّنَّ |
      | ءذن | 9 | اسْتَأْذَنْتُ | اسْتَأْذَنَّا | اسْتَأْذَنْتَ | اسْتَأْذَنْتِ | اسْتَأْذَنْتُمَا | اسْتَأْذَنْتُمْ | اسْتَأْذَنْتُنَّ | اسْتَأْذَنَ | اسْتَأْذَنَتْ | اسْتَأْذَنَا | اسْتَأْذَنَتَا | اسْتَأْذَنُوا | اسْتَأْذَنَّ |
      | حزو | 8 | تَحَزَّيْتُ | تَحَزَّيْنَا | تَحَزَّيْتَ | تَحَزَّيْتِ | تَحَزَّيْتُمَا | تَحَزَّيْتُمْ | تَحَزَّيْتُنَّ | تَحَزَّى | تَحَزَّتْ | تَحَزَّيَا | تَحَزَّتَا | تَحَزَّوْا | تَحَزَّيْنَ |
      | حزو | 10 | احْزَوْزَيْتُ | احْزَوْزَيْنَا | احْزَوْزَيْتَ | احْزَوْزَيْتِ | احْزَوْزَيْتُمَا | احْزَوْزَيْتُمْ | احْزَوْزَيْتُنَّ | احْزَوْزَى | احْزَوْزَتْ | احْزَوْزَيَا | احْزَوْزَتَا | احْزَوْزَوْا | احْزَوْزَيْنَ |
      | جءي | 11 | اجْأَوَّيْتُ | اجْأَوَّيْنَا | اجْأَوَّيْتَ | اجْأَوَّيْتِ | اجْأَوَّيْتُمَا | اجْأَوَّيْتُمْ | اجْأَوَّيْتُنَّ | اجْأَوَّى | اجْأَوَّتْ | اجْأَوَّيَا | اجْأَوَّتَا | اجْأَوَّوْا | اجْأَوَّيْنَ |
      | جءي | 1 | أَجْأَيْتُ | أَجْأَيْنَا | أَجْأَيْتَ | أَجْأَيْتِ | أَجْأَيْتُمَا | أَجْأَيْتُمْ | أَجْأَيْتُنَّ | أَجْأَى | أَجْأَتْ | أَجْأَيَا | أَجْأَتَا | أَجْأَوْا | أَجْأَيْنَ |
      | دهم | 1 | أَدْهَمْتُ | أَدْهَمْنَا | أَدْهَمْتَ | أَدْهَمْتِ | أَدْهَمْتُمَا | أَدْهَمْتُمْ | أَدْهَمْتُنَّ | أَدْهَمَ | أَدْهَمَتْ | أَدْهَمَا | أَدْهَمَتَا | أَدْهَمُوا | أَدْهَمْنَ |
      | دهم | 12 | ادْهَامَمْتُ | ادْهَامَمْنَا | ادْهَامَمْتَ | ادْهَامَمْتِ | ادْهَامَمْتُمَا | ادْهَامَمْتُمْ | ادْهَامَمْتُنَّ | ادْهَامَّ | ادْهَامَّتْ | ادْهَامَّا | ادْهَامَّتَا | ادْهَامُّوا | ادْهَامَمْنَ |
      | دهم | 2 | دَهَّمْتُ | دَهَّمْنَا | دَهَّمْتَ | دَهَّمْتِ | دَهَّمْتُمَا | دَهَّمْتُمْ | دَهَّمْتُنَّ | دَهَّمَ | دَهَّمَتْ | دَهَّمَا | دَهَّمَتَا | دَهَّمُوا | دَهَّمْنَ |
      | دهم | 6 | ادْهَمَمْتُ | ادْهَمَمْنَا | ادْهَمَمْتَ | ادْهَمَمْتِ | ادْهَمَمْتُمَا | ادْهَمَمْتُمْ | ادْهَمَمْتُنَّ | ادْهَمَّ | ادْهَمَّتْ | ادْهَمَّا | ادْهَمَّتَا | ادْهَمُّوا | ادْهَمَمْنَ |
      | دهم | 8 | تَدَهَّمْتُ | تَدَهَّمْنَا | تَدَهَّمْتَ | تَدَهَّمْتِ | تَدَهَّمْتُمَا | تَدَهَّمْتُمْ | تَدَهَّمْتُنَّ | تَدَهَّمَ | تَدَهَّمَتْ | تَدَهَّمَا | تَدَهَّمَتَا | تَدَهَّمُوا | تَدَهَّمْنَ |
      | بلج | 1 | أَبْلَجْتُ | أَبْلَجْنَا | أَبْلَجْتَ | أَبْلَجْتِ | أَبْلَجْتُمَا | أَبْلَجْتُمْ | أَبْلَجْتُنَّ | أَبْلَجَ | أَبْلَجَتْ | أَبْلَجَا | أَبْلَجَتَا | أَبْلَجُوا | أَبْلَجْنَ |
      | بلج | 12 | ابْلاجَجْتُ | ابْلاجَجْنَا | ابْلاجَجْتَ | ابْلاجَجْتِ | ابْلاجَجْتُمَا | ابْلاجَجْتُمْ | ابْلاجَجْتُنَّ | ابْلاجَّ | ابْلاجَّتْ | ابْلاجَّا | ابْلاجَّتَا | ابْلاجُّوا | ابْلاجَجْنَ |
      | بلج | 4 | انْبَلَجْتُ | انْبَلَجْنَا | انْبَلَجْتَ | انْبَلَجْتِ | انْبَلَجْتُمَا | انْبَلَجْتُمْ | انْبَلَجْتُنَّ | انْبَلَجَ | انْبَلَجَتْ | انْبَلَجَا | انْبَلَجَتَا | انْبَلَجُوا | انْبَلَجْنَ |
      | بلج | 5 | ابْتَلَجْتُ | ابْتَلَجْنَا | ابْتَلَجْتَ | ابْتَلَجْتِ | ابْتَلَجْتُمَا | ابْتَلَجْتُمْ | ابْتَلَجْتُنَّ | ابْتَلَجَ | ابْتَلَجَتْ | ابْتَلَجَا | ابْتَلَجَتَا | ابْتَلَجُوا | ابْتَلَجْنَ |
      | بلج | 8 | تَبَلَّجْتُ | تَبَلَّجْنَا | تَبَلَّجْتَ | تَبَلَّجْتِ | تَبَلَّجْتُمَا | تَبَلَّجْتُمْ | تَبَلَّجْتُنَّ | تَبَلَّجَ | تَبَلَّجَتْ | تَبَلَّجَا | تَبَلَّجَتَا | تَبَلَّجُوا | تَبَلَّجْنَ |
      | قبل | 1 | أَقْبَلْتُ | أَقْبَلْنَا | أَقْبَلْتَ | أَقْبَلْتِ | أَقْبَلْتُمَا | أَقْبَلْتُمْ | أَقْبَلْتُنَّ | أَقْبَلَ | أَقْبَلَتْ | أَقْبَلا | أَقْبَلَتَا | أَقْبَلُوا | أَقْبَلْنَ |
      | قبل | 12 | اقْبَالَلْتُ | اقْبَالَلْنَا | اقْبَالَلْتَ | اقْبَالَلْتِ | اقْبَالَلْتُمَا | اقْبَالَلْتُمْ | اقْبَالَلْتُنَّ | اقْبَالَّ | اقْبَالَّتْ | اقْبَالاَّ | اقْبَالَّتَا | اقْبَالُّوا | اقْبَالَلْنَ |
      | قبل | 2 | قَبَّلْتُ | قَبَّلْنَا | قَبَّلْتَ | قَبَّلْتِ | قَبَّلْتُمَا | قَبَّلْتُمْ | قَبَّلْتُنَّ | قَبَّلَ | قَبَّلَتْ | قَبَّلا | قَبَّلَتَا | قَبَّلُوا | قَبَّلْنَ |
      | قبل | 3 | قَابَلْتُ | قَابَلْنَا | قَابَلْتَ | قَابَلْتِ | قَابَلْتُمَا | قَابَلْتُمْ | قَابَلْتُنَّ | قَابَلَ | قَابَلَتْ | قَابَلا | قَابَلَتَا | قَابَلُوا | قَابَلْنَ |
      | قبل | 5 | اقْتَبَلْتُ | اقْتَبَلْنَا | اقْتَبَلْتَ | اقْتَبَلْتِ | اقْتَبَلْتُمَا | اقْتَبَلْتُمْ | اقْتَبَلْتُنَّ | اقْتَبَلَ | اقْتَبَلَتْ | اقْتَبَلا | اقْتَبَلَتَا | اقْتَبَلُوا | اقْتَبَلْنَ |
      | قبل | 6 | اقْبَلَلْتُ | اقْبَلَلْنَا | اقْبَلَلْتَ | اقْبَلَلْتِ | اقْبَلَلْتُمَا | اقْبَلَلْتُمْ | اقْبَلَلْتُنَّ | اقْبَلَّ | اقْبَلَّتْ | اقْبَلاَّ | اقْبَلَّتَا | اقْبَلُّوا | اقْبَلَلْنَ |
      | قبل | 7 | تَقَابَلْتُ | تَقَابَلْنَا | تَقَابَلْتَ | تَقَابَلْتِ | تَقَابَلْتُمَا | تَقَابَلْتُمْ | تَقَابَلْتُنَّ | تَقَابَلَ | تَقَابَلَتْ | تَقَابَلا | تَقَابَلَتَا | تَقَابَلُوا | تَقَابَلْنَ |
      | قبل | 8 | تَقَبَّلْتُ | تَقَبَّلْنَا | تَقَبَّلْتَ | تَقَبَّلْتِ | تَقَبَّلْتُمَا | تَقَبَّلْتُمْ | تَقَبَّلْتُنَّ | تَقَبَّلَ | تَقَبَّلَتْ | تَقَبَّلا | تَقَبَّلَتَا | تَقَبَّلُوا | تَقَبَّلْنَ |
      | قبل | 9 | اسْتَقْبَلْتُ | اسْتَقْبَلْنَا | اسْتَقْبَلْتَ | اسْتَقْبَلْتِ | اسْتَقْبَلْتُمَا | اسْتَقْبَلْتُمْ | اسْتَقْبَلْتُنَّ | اسْتَقْبَلَ | اسْتَقْبَلَتْ | اسْتَقْبَلا | اسْتَقْبَلَتَا | اسْتَقْبَلُوا | اسْتَقْبَلْنَ |
      | ءيس | 2 | أَيَّسْتُ | أَيَّسْنَا | أَيَّسْتَ | أَيَّسْتِ | أَيَّسْتُمَا | أَيَّسْتُمْ | أَيَّسْتُنَّ | أَيَّسَ | أَيَّسَتْ | أَيَّسَا | أَيَّسَتَا | أَيَّسُوا | أَيَّسْنَ |
      | ءيس | 8 | تَأَيَّسْتُ | تَأَيَّسْنَا | تَأَيَّسْتَ | تَأَيَّسْتِ | تَأَيَّسْتُمَا | تَأَيَّسْتُمْ | تَأَيَّسْتُنَّ | تَأَيَّسَ | تَأَيَّسَتْ | تَأَيَّسَا | تَأَيَّسَتَا | تَأَيَّسُوا | تَأَيَّسْنَ |
      | صبر | 1 | أَصْبَرْتُ | أَصْبَرْنَا | أَصْبَرْتَ | أَصْبَرْتِ | أَصْبَرْتُمَا | أَصْبَرْتُمْ | أَصْبَرْتُنَّ | أَصْبَرَ | أَصْبَرَتْ | أَصْبَرَا | أَصْبَرَتَا | أَصْبَرُوا | أَصْبَرْنَ |
      | صبر | 12 | اصْبَارَرْتُ | اصْبَارَرْنَا | اصْبَارَرْتَ | اصْبَارَرْتِ | اصْبَارَرْتُمَا | اصْبَارَرْتُمْ | اصْبَارَرْتُنَّ | اصْبَارَّ | اصْبَارَّتْ | اصْبَارَّا | اصْبَارَّتَا | اصْبَارُّوا | اصْبَارَرْنَ |
      | صبر | 2 | صَبَّرْتُ | صَبَّرْنَا | صَبَّرْتَ | صَبَّرْتِ | صَبَّرْتُمَا | صَبَّرْتُمْ | صَبَّرْتُنَّ | صَبَّرَ | صَبَّرَتْ | صَبَّرَا | صَبَّرَتَا | صَبَّرُوا | صَبَّرْنَ |
      | صبر | 3 | صَابَرْتُ | صَابَرْنَا | صَابَرْتَ | صَابَرْتِ | صَابَرْتُمَا | صَابَرْتُمْ | صَابَرْتُنَّ | صَابَرَ | صَابَرَتْ | صَابَرَا | صَابَرَتَا | صَابَرُوا | صَابَرْنَ |
      | صبر | 5 | اصْطَبَرْتُ | اصْطَبَرْنَا | اصْطَبَرْتَ | اصْطَبَرْتِ | اصْطَبَرْتُمَا | اصْطَبَرْتُمْ | اصْطَبَرْتُنَّ | اصْطَبَرَ | اصْطَبَرَتْ | اصْطَبَرَا | اصْطَبَرَتَا | اصْطَبَرُوا | اصْطَبَرْنَ |
      | صبر | 8 | تَصَبَّرْتُ | تَصَبَّرْنَا | تَصَبَّرْتَ | تَصَبَّرْتِ | تَصَبَّرْتُمَا | تَصَبَّرْتُمْ | تَصَبَّرْتُنَّ | تَصَبَّرَ | تَصَبَّرَتْ | تَصَبَّرَا | تَصَبَّرَتَا | تَصَبَّرُوا | تَصَبَّرْنَ |
      | صبر | 9 | اسْتَصْبَرْتُ | اسْتَصْبَرْنَا | اسْتَصْبَرْتَ | اسْتَصْبَرْتِ | اسْتَصْبَرْتُمَا | اسْتَصْبَرْتُمْ | اسْتَصْبَرْتُنَّ | اسْتَصْبَرَ | اسْتَصْبَرَتْ | اسْتَصْبَرَا | اسْتَصْبَرَتَا | اسْتَصْبَرُوا | اسْتَصْبَرْنَ |
      | نتء | 5 | انْتَتَأْتُ | انْتَتَأْنَا | انْتَتَأْتَ | انْتَتَأْتِ | انْتَتَأْتُمَا | انْتَتَأْتُمْ | انْتَتَأْتُنَّ | انْتَتَأَ | انْتَتَأَتْ | انْتَتَأَا | انْتَتَأَتَا | انْتَتَؤُوا | انْتَتَأْنَ |
      | ختو | 1 | أَخْتَيْتُ | أَخْتَيْنَا | أَخْتَيْتَ | أَخْتَيْتِ | أَخْتَيْتُمَا | أَخْتَيْتُمْ | أَخْتَيْتُنَّ | أَخْتَى | أَخْتَتْ | أَخْتَيَا | أَخْتَتَا | أَخْتَوْا | أَخْتَيْنَ |
      | ختو | 5 | اخْتَتَيْتُ | اخْتَتَيْنَا | اخْتَتَيْتَ | اخْتَتَيْتِ | اخْتَتَيْتُمَا | اخْتَتَيْتُمْ | اخْتَتَيْتُنَّ | اخْتَتَى | اخْتَتَتْ | اخْتَتَيَا | اخْتَتَتَا | اخْتَتَوْا | اخْتَتَيْنَ |
      | نءي | 1 | أَنْأَيْتُ | أَنْأَيْنَا | أَنْأَيْتَ | أَنْأَيْتِ | أَنْأَيْتُمَا | أَنْأَيْتُمْ | أَنْأَيْتُنَّ | أَنْأَى | أَنْأَتْ | أَنْأَيَا | أَنْأَتَا | أَنْأَوْا | أَنْأَيْنَ |
      | نءي | 3 | نَاءَيْتُ | نَاءَيْنَا | نَاءَيْتَ | نَاءَيْتِ | نَاءَيْتُمَا | نَاءَيْتُمْ | نَاءَيْتُنَّ | نَاءَى | نَاءَتْ | نَاءَيَا | نَاءَتَا | نَاءَوْا | نَاءَيْنَ |
      | نءي | 5 | انْتَأَيْتُ | انْتَأَيْنَا | انْتَأَيْتَ | انْتَأَيْتِ | انْتَأَيْتُمَا | انْتَأَيْتُمْ | انْتَأَيْتُنَّ | انْتَأَى | انْتَأَتْ | انْتَأَيَا | انْتَأَتَا | انْتَأَوْا | انْتَأَيْنَ |
      | نءي | 7 | تَنَاءَيْتُ | تَنَاءَيْنَا | تَنَاءَيْتَ | تَنَاءَيْتِ | تَنَاءَيْتُمَا | تَنَاءَيْتُمْ | تَنَاءَيْتُنَّ | تَنَاءَى | تَنَاءَتْ | تَنَاءَيَا | تَنَاءَتَا | تَنَاءَوْا | تَنَاءَيْنَ |
      | دخر | 1 | أَدْخَرْتُ | أَدْخَرْنَا | أَدْخَرْتَ | أَدْخَرْتِ | أَدْخَرْتُمَا | أَدْخَرْتُمْ | أَدْخَرْتُنَّ | أَدْخَرَ | أَدْخَرَتْ | أَدْخَرَا | أَدْخَرَتَا | أَدْخَرُوا | أَدْخَرْنَ |
      | دخر | 5 | ادَّخَرْتُ | ادَّخَرْنَا | ادَّخَرْتَ | ادَّخَرْتِ | ادَّخَرْتُمَا | ادَّخَرْتُمْ | ادَّخَرْتُنَّ | ادَّخَرَ | ادَّخَرَتْ | ادَّخَرَا | ادَّخَرَتَا | ادَّخَرُوا | ادَّخَرْنَ |
      | ملح | 1 | أَمْلَحْتُ | أَمْلَحْنَا | أَمْلَحْتَ | أَمْلَحْتِ | أَمْلَحْتُمَا | أَمْلَحْتُمْ | أَمْلَحْتُنَّ | أَمْلَحَ | أَمْلَحَتْ | أَمْلَحَا | أَمْلَحَتَا | أَمْلَحُوا | أَمْلَحْنَ |
      | ملح | 12 | امْلاحَحْتُ | امْلاحَحْنَا | امْلاحَحْتَ | امْلاحَحْتِ | امْلاحَحْتُمَا | امْلاحَحْتُمْ | امْلاحَحْتُنَّ | امْلاحَّ | امْلاحَّتْ | امْلاحَّا | امْلاحَّتَا | امْلاحُّوا | امْلاحَحْنَ |
      | ملح | 2 | مَلَّحْتُ | مَلَّحْنَا | مَلَّحْتَ | مَلَّحْتِ | مَلَّحْتُمَا | مَلَّحْتُمْ | مَلَّحْتُنَّ | مَلَّحَ | مَلَّحَتْ | مَلَّحَا | مَلَّحَتَا | مَلَّحُوا | مَلَّحْنَ |
      | ملح | 3 | مَالَحْتُ | مَالَحْنَا | مَالَحْتَ | مَالَحْتِ | مَالَحْتُمَا | مَالَحْتُمْ | مَالَحْتُنَّ | مَالَحَ | مَالَحَتْ | مَالَحَا | مَالَحَتَا | مَالَحُوا | مَالَحْنَ |
      | ملح | 5 | امْتَلَحْتُ | امْتَلَحْنَا | امْتَلَحْتَ | امْتَلَحْتِ | امْتَلَحْتُمَا | امْتَلَحْتُمْ | امْتَلَحْتُنَّ | امْتَلَحَ | امْتَلَحَتْ | امْتَلَحَا | امْتَلَحَتَا | امْتَلَحُوا | امْتَلَحْنَ |
      | ملح | 6 | امْلَحَحْتُ | امْلَحَحْنَا | امْلَحَحْتَ | امْلَحَحْتِ | امْلَحَحْتُمَا | امْلَحَحْتُمْ | امْلَحَحْتُنَّ | امْلَحَّ | امْلَحَّتْ | امْلَحَّا | امْلَحَّتَا | امْلَحُّوا | امْلَحَحْنَ |
      | ملح | 8 | تَمَلَّحْتُ | تَمَلَّحْنَا | تَمَلَّحْتَ | تَمَلَّحْتِ | تَمَلَّحْتُمَا | تَمَلَّحْتُمْ | تَمَلَّحْتُنَّ | تَمَلَّحَ | تَمَلَّحَتْ | تَمَلَّحَا | تَمَلَّحَتَا | تَمَلَّحُوا | تَمَلَّحْنَ |
      | ملح | 9 | اسْتَمْلَحْتُ | اسْتَمْلَحْنَا | اسْتَمْلَحْتَ | اسْتَمْلَحْتِ | اسْتَمْلَحْتُمَا | اسْتَمْلَحْتُمْ | اسْتَمْلَحْتُنَّ | اسْتَمْلَحَ | اسْتَمْلَحَتْ | اسْتَمْلَحَا | اسْتَمْلَحَتَا | اسْتَمْلَحُوا | اسْتَمْلَحْنَ |
      | شءم | 1 | أَشْأَمْتُ | أَشْأَمْنَا | أَشْأَمْتَ | أَشْأَمْتِ | أَشْأَمْتُمَا | أَشْأَمْتُمْ | أَشْأَمْتُنَّ | أَشْأَمَ | أَشْأَمَتْ | أَشْأَمَا | أَشْأَمَتَا | أَشْأَمُوا | أَشْأَمْنَ |
      | شءم | 2 | شَأَّمْتُ | شَأَّمْنَا | شَأَّمْتَ | شَأَّمْتِ | شَأَّمْتُمَا | شَأَّمْتُمْ | شَأَّمْتُنَّ | شَأَّمَ | شَأَّمَتْ | شَأَّمَا | شَأَّمَتَا | شَأَّمُوا | شَأَّمْنَ |
      | شءم | 3 | شَاءَمْتُ | شَاءَمْنَا | شَاءَمْتَ | شَاءَمْتِ | شَاءَمْتُمَا | شَاءَمْتُمْ | شَاءَمْتُنَّ | شَاءَمَ | شَاءَمَتْ | شَاءَمَا | شَاءَمَتَا | شَاءَمُوا | شَاءَمْنَ |
      | شءم | 7 | تَشَاءَمْتُ | تَشَاءَمْنَا | تَشَاءَمْتَ | تَشَاءَمْتِ | تَشَاءَمْتُمَا | تَشَاءَمْتُمْ | تَشَاءَمْتُنَّ | تَشَاءَمَ | تَشَاءَمَتْ | تَشَاءَمَا | تَشَاءَمَتَا | تَشَاءَمُوا | تَشَاءَمْنَ |
      | شءم | 8 | تَشَأَّمْتُ | تَشَأَّمْنَا | تَشَأَّمْتَ | تَشَأَّمْتِ | تَشَأَّمْتُمَا | تَشَأَّمْتُمْ | تَشَأَّمْتُنَّ | تَشَأَّمَ | تَشَأَّمَتْ | تَشَأَّمَا | تَشَأَّمَتَا | تَشَأَّمُوا | تَشَأَّمْنَ |
      | شءم | 9 | اسْتَشْأَمْتُ | اسْتَشْأَمْنَا | اسْتَشْأَمْتَ | اسْتَشْأَمْتِ | اسْتَشْأَمْتُمَا | اسْتَشْأَمْتُمْ | اسْتَشْأَمْتُنَّ | اسْتَشْأَمَ | اسْتَشْأَمَتْ | اسْتَشْأَمَا | اسْتَشْأَمَتَا | اسْتَشْأَمُوا | اسْتَشْأَمْنَ |
      | يقظ | 1 | أَيْقَظْتُ | أَيْقَظْنَا | أَيْقَظْتَ | أَيْقَظْتِ | أَيْقَظْتُمَا | أَيْقَظْتُمْ | أَيْقَظْتُنَّ | أَيْقَظَ | أَيْقَظَتْ | أَيْقَظَا | أَيْقَظَتَا | أَيْقَظُوا | أَيْقَظْنَ |
      | يقظ | 2 | يَقَّظْتُ | يَقَّظْنَا | يَقَّظْتَ | يَقَّظْتِ | يَقَّظْتُمَا | يَقَّظْتُمْ | يَقَّظْتُنَّ | يَقَّظَ | يَقَّظَتْ | يَقَّظَا | يَقَّظَتَا | يَقَّظُوا | يَقَّظْنَ |
      | يقظ | 8 | تَيَقَّظْتُ | تَيَقَّظْنَا | تَيَقَّظْتَ | تَيَقَّظْتِ | تَيَقَّظْتُمَا | تَيَقَّظْتُمْ | تَيَقَّظْتُنَّ | تَيَقَّظَ | تَيَقَّظَتْ | تَيَقَّظَا | تَيَقَّظَتَا | تَيَقَّظُوا | تَيَقَّظْنَ |
      | يقظ | 9 | اسْتَيْقَظْتُ | اسْتَيْقَظْنَا | اسْتَيْقَظْتَ | اسْتَيْقَظْتِ | اسْتَيْقَظْتُمَا | اسْتَيْقَظْتُمْ | اسْتَيْقَظْتُنَّ | اسْتَيْقَظَ | اسْتَيْقَظَتْ | اسْتَيْقَظَا | اسْتَيْقَظَتَا | اسْتَيْقَظُوا | اسْتَيْقَظْنَ |
      | ءسو | 2 | أَسَّيْتُ | أَسَّيْنَا | أَسَّيْتَ | أَسَّيْتِ | أَسَّيْتُمَا | أَسَّيْتُمْ | أَسَّيْتُنَّ | أَسَّى | أَسَّتْ | أَسَّيَا | أَسَّتَا | أَسَّوْا | أَسَّيْنَ |
      | ءسو | 3 | آسَيْتُ | آسَيْنَا | آسَيْتَ | آسَيْتِ | آسَيْتُمَا | آسَيْتُمْ | آسَيْتُنَّ | آسَى | آسَتْ | آسَيَا | آسَتَا | آسَوْا | آسَيْنَ |
      | ءسو | 5 | ائْتَسَيْتُ | ائْتَسَيْنَا | ائْتَسَيْتَ | ائْتَسَيْتِ | ائْتَسَيْتُمَا | ائْتَسَيْتُمْ | ائْتَسَيْتُنَّ | ائْتَسَى | ائْتَسَتْ | ائْتَسَيَا | ائْتَسَتَا | ائْتَسَوْا | ائْتَسَيْنَ |
      | ءسو | 7 | تَآسَيْتُ | تَآسَيْنَا | تَآسَيْتَ | تَآسَيْتِ | تَآسَيْتُمَا | تَآسَيْتُمْ | تَآسَيْتُنَّ | تَآسَى | تَآسَتْ | تَآسَيَا | تَآسَتَا | تَآسَوْا | تَآسَيْنَ |
      | ءسو | 8 | تَأَسَّيْتُ | تَأَسَّيْنَا | تَأَسَّيْتَ | تَأَسَّيْتِ | تَأَسَّيْتُمَا | تَأَسَّيْتُمْ | تَأَسَّيْتُنَّ | تَأَسَّى | تَأَسَّتْ | تَأَسَّيَا | تَأَسَّتَا | تَأَسَّوْا | تَأَسَّيْنَ |
      | ءسي | 1 | آسَيْتُ | آسَيْنَا | آسَيْتَ | آسَيْتِ | آسَيْتُمَا | آسَيْتُمْ | آسَيْتُنَّ | آسَى | آسَتْ | آسَيَا | آسَتَا | آسَوْا | آسَيْنَ |
      | ءسي | 3 | آسَيْتُ | آسَيْنَا | آسَيْتَ | آسَيْتِ | آسَيْتُمَا | آسَيْتُمْ | آسَيْتُنَّ | آسَى | آسَتْ | آسَيَا | آسَتَا | آسَوْا | آسَيْنَ |
      | ءضض | 3 | آضَضْتُ | آضَضْنَا | آضَضْتَ | آضَضْتِ | آضَضْتُمَا | آضَضْتُمْ | آضَضْتُنَّ | آضَّ | آضَّتْ | آضَّا | آضَّتَا | آضُّوا | آضَضْنَ |
      | ءضض | 5 | ائْتَضَضْتُ | ائْتَضَضْنَا | ائْتَضَضْتَ | ائْتَضَضْتِ | ائْتَضَضْتُمَا | ائْتَضَضْتُمْ | ائْتَضَضْتُنَّ | ائْتَضَّ | ائْتَضَّتْ | ائْتَضَّا | ائْتَضَّتَا | ائْتَضُّوا | ائْتَضَضْنَ |
      | حوي | 2 | حَوَّيْتُ | حَوَّيْنَا | حَوَّيْتَ | حَوَّيْتِ | حَوَّيْتُمَا | حَوَّيْتُمْ | حَوَّيْتُنَّ | حَوَّى | حَوَّتْ | حَوَّيَا | حَوَّتَا | حَوَّوْا | حَوَّيْنَ |
      | حوي | 5 | احْتَوَيْتُ | احْتَوَيْنَا | احْتَوَيْتَ | احْتَوَيْتِ | احْتَوَيْتُمَا | احْتَوَيْتُمْ | احْتَوَيْتُنَّ | احْتَوَى | احْتَوَتْ | احْتَوَيَا | احْتَوَتَا | احْتَوَوْا | احْتَوَيْنَ |
      | حوي | 8 | تَحَوَّيْتُ | تَحَوَّيْنَا | تَحَوَّيْتَ | تَحَوَّيْتِ | تَحَوَّيْتُمَا | تَحَوَّيْتُمْ | تَحَوَّيْتُنَّ | تَحَوَّى | تَحَوَّتْ | تَحَوَّيَا | تَحَوَّتَا | تَحَوَّوْا | تَحَوَّيْنَ |
      | حيي | 1 | أَحْيَيْتُ | أَحْيَيْنَا | أَحْيَيْتَ | أَحْيَيْتِ | أَحْيَيْتُمَا | أَحْيَيْتُمْ | أَحْيَيْتُنَّ | أَحْيَا | أَحْيَتْ | أَحْيَيَا | أَحْيَتَا | أَحْيَوْا | أَحْيَيْنَ |
      | حيي | 2 | حَيَّيْتُ | حَيَّيْنَا | حَيَّيْتَ | حَيَّيْتِ | حَيَّيْتُمَا | حَيَّيْتُمْ | حَيَّيْتُنَّ | حَيَّا | حَيَّتْ | حَيَّيَا | حَيَّتَا | حَيَّوْا | حَيَّيْنَ |
      | حيي | 3 | حَايَيْتُ | حَايَيْنَا | حَايَيْتَ | حَايَيْتِ | حَايَيْتُمَا | حَايَيْتُمْ | حَايَيْتُنَّ | حَايَا | حَايَتْ | حَايَيَا | حَايَتَا | حَايَوْا | حَايَيْنَ |
      | حيي | 7 | تَحَايَيْتُ | تَحَايَيْنَا | تَحَايَيْتَ | تَحَايَيْتِ | تَحَايَيْتُمَا | تَحَايَيْتُمْ | تَحَايَيْتُنَّ | تَحَايَا | تَحَايَتْ | تَحَايَيَا | تَحَايَتَا | تَحَايَوْا | تَحَايَيْنَ |
      | حيي | 8 | تَحَيَّيْتُ | تَحَيَّيْنَا | تَحَيَّيْتَ | تَحَيَّيْتِ | تَحَيَّيْتُمَا | تَحَيَّيْتُمْ | تَحَيَّيْتُنَّ | تَحَيَّا | تَحَيَّتْ | تَحَيَّيَا | تَحَيَّتَا | تَحَيَّوْا | تَحَيَّيْنَ |
      | حيي | 9 | اسْتَحْيَيْتُ | اسْتَحْيَيْنَا | اسْتَحْيَيْتَ | اسْتَحْيَيْتِ | اسْتَحْيَيْتُمَا | اسْتَحْيَيْتُمْ | اسْتَحْيَيْتُنَّ | اسْتَحْيَا | اسْتَحْيَتْ | اسْتَحْيَيَا | اسْتَحْيَتَا | اسْتَحْيَوْا | اسْتَحْيَيْنَ |
