###
# /*
# *
# * MIT License
# *
# * Copyright (c) 2021 Abdalaziz Alsaydi
# *
# * Permission is hereby granted, free of charge, to any person obtaining a copy
# * of this software and associated documentation files (the "Software"), to deal
# * in the Software without restriction, including without limitation the rights
# * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
# * copies of the Software, and to permit persons to whom the Software is
# * furnished to do so, subject to the following conditions:
# *
# * The above copyright notice and this permission notice shall be included in all
# * copies or substantial portions of the Software.
# *
# * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
# * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
# * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
# * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
# * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
# * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
# * SOFTWARE.
# */

Feature: augmented trilateral verb conjugation in accusative state
# المضارع المنصوب المبني للمعلوم من الثلاثي المزيد
  Scenario Outline: active augmented trilateral verb present conjugation in accusative state
    Given an augmented verb
    When the augmented trilateral verb is conjugated in "Accusative" state
    Then first person singular present conjugation the verb "<verb>" and formula of "<formula>" is "<single_first>"
    And first person plural present conjugation the verb "<verb>" and formula of "<formula>" is "<plural_first>"
    And masculine singular second person present conjugation the verb "<verb>" and formula of "<formula>" is "<m_single_second>"
    And feminine singular second person present conjugation the verb "<verb>" and formula of "<formula>" is "<f_single_second>"
    And masculine dual second person present conjugation the verb "<verb>" and formula of "<formula>" is "<m_dual_second>"
    And masculine plural second person present conjugation the verb "<verb>" and formula of "<formula>" is "<m_plural_second>"
    And feminine plural second person present conjugation the verb "<verb>" and formula of "<formula>" is "<f_plural_second>"
    And masculine singular third person present conjugation the verb "<verb>" and formula of "<formula>" is "<m_single_third>"
    And feminine singular third person present conjugation the verb "<verb>" and formula of "<formula>" is "<f_single_third>"
    And masculine dual third person present conjugation the verb "<verb>" and formula of "<formula>" is "<m_dual_third>"
    And feminine dual third person present conjugation the verb "<verb>" and formula of "<formula>" is "<f_dual_third>"
    And masculine plural third person present conjugation the verb "<verb>" and formula of "<formula>" is "<m_plural_third>"
    And feminine plural third person present conjugation the verb "<verb>" and formula of "<formula>" is "<f_plural_third>"
    Examples:
      | verb | formula | single_first | plural_first | m_single_second | f_single_second | m_dual_second   | m_plural_second | f_plural_second | m_single_third | f_single_third | m_dual_third    | f_dual_third    | m_plural_third  | f_plural_third |
      | ءتي | 1 | أُوتِيَ | نُؤْتِيَ | تُؤْتِيَ | تُؤْتِي | تُؤْتِيَا | تُؤْتُوا | تُؤْتِينَ | يُؤْتِيَ | تُؤْتِيَ | يُؤْتِيَا | تُؤْتِيَا | يُؤْتُوا | يُؤْتِينَ |
      | ءتي | 2 | أُؤَتِّيَ | نُؤَتِّيَ | تُؤَتِّيَ | تُؤَتِّي | تُؤَتِّيَا | تُؤَتُّوا | تُؤَتِّينَ | يُؤَتِّيَ | تُؤَتِّيَ | يُؤَتِّيَا | تُؤَتِّيَا | يُؤَتُّوا | يُؤَتِّينَ |
      | ءتي | 8 | أَتَأَتَّى | نَتَأَتَّى | تَتَأَتَّى | تَتَأَتَّيْ | تَتَأَتَّيَا | تَتَأَتَّوْا | تَتَأَتَّيْنَ | يَتَأَتَّى | تَتَأَتَّى | يَتَأَتَّيَا | تَتَأَتَّيَا | يَتَأَتَّوْا | يَتَأَتَّيْنَ |
      | ءتي | 9 | أَسْتَأْتِيَ | نَسْتَأْتِيَ | تَسْتَأْتِيَ | تَسْتَأْتِي | تَسْتَأْتِيَا | تَسْتَأْتُوا | تَسْتَأْتِينَ | يَسْتَأْتِيَ | تَسْتَأْتِيَ | يَسْتَأْتِيَا | تَسْتَأْتِيَا | يَسْتَأْتُوا | يَسْتَأْتِينَ |
      | ءدي | 1 | أُودِيَ | نُؤْدِيَ | تُؤْدِيَ | تُؤْدِي | تُؤْدِيَا | تُؤْدُوا | تُؤْدِينَ | يُؤْدِيَ | تُؤْدِيَ | يُؤْدِيَا | تُؤْدِيَا | يُؤْدُوا | يُؤْدِينَ |
      | ءدي | 2 | أُؤَدِّيَ | نُؤَدِّيَ | تُؤَدِّيَ | تُؤَدِّي | تُؤَدِّيَا | تُؤَدُّوا | تُؤَدِّينَ | يُؤَدِّيَ | تُؤَدِّيَ | يُؤَدِّيَا | تُؤَدِّيَا | يُؤَدُّوا | يُؤَدِّينَ |
      | ءدي | 7 | أَتَآدَى | نَتَآدَى | تَتَآدَى | تَتَآدَيْ | تَتَآدَيَا | تَتَآدَوْا | تَتَآدَيْنَ | يَتَآدَى | تَتَآدَى | يَتَآدَيَا | تَتَآدَيَا | يَتَآدَوْا | يَتَآدَيْنَ |
      | ءدي | 8 | أَتَأَدَّى | نَتَأَدَّى | تَتَأَدَّى | تَتَأَدَّيْ | تَتَأَدَّيَا | تَتَأَدَّوْا | تَتَأَدَّيْنَ | يَتَأَدَّى | تَتَأَدَّى | يَتَأَدَّيَا | تَتَأَدَّيَا | يَتَأَدَّوْا | يَتَأَدَّيْنَ |
      | ءدي | 9 | أَسْتَأْدِيَ | نَسْتَأْدِيَ | تَسْتَأْدِيَ | تَسْتَأْدِي | تَسْتَأْدِيَا | تَسْتَأْدُوا | تَسْتَأْدِينَ | يَسْتَأْدِيَ | تَسْتَأْدِيَ | يَسْتَأْدِيَا | تَسْتَأْدِيَا | يَسْتَأْدُوا | يَسْتَأْدِينَ |
      | ءجر | 1 | أُوجِرَ | نُؤْجِرَ | تُؤْجِرَ | تُؤْجِرِي | تُؤْجِرَا | تُؤْجِرُوا | تُؤْجِرْنَ | يُؤْجِرَ | تُؤْجِرَ | يُؤْجِرَا | تُؤْجِرَا | يُؤْجِرُوا | يُؤْجِرْنَ |
      | ءجر | 3 | أُؤَاجِرَ | نُؤَاجِرَ | تُؤَاجِرَ | تُؤَاجِرِي | تُؤَاجِرَا | تُؤَاجِرُوا | تُؤَاجِرْنَ | يُؤَاجِرَ | تُؤَاجِرَ | يُؤَاجِرَا | تُؤَاجِرَا | يُؤَاجِرُوا | يُؤَاجِرْنَ |
      | ءجر | 5 | آتَجِرَ | نَأْتَجِرَ | تَأْتَجِرَ | تَأْتَجِرِي | تَأْتَجِرَا | تَأْتَجِرُوا | تَأْتَجِرْنَ | يَأْتَجِرَ | تَأْتَجِرَ | يَأْتَجِرَا | تَأْتَجِرَا | يَأْتَجِرُوا | يَأْتَجِرْنَ |
      | ءجر | 9 | أَسْتَأْجِرَ | نَسْتَأْجِرَ | تَسْتَأْجِرَ | تَسْتَأْجِرِي | تَسْتَأْجِرَا | تَسْتَأْجِرُوا | تَسْتَأْجِرْنَ | يَسْتَأْجِرَ | تَسْتَأْجِرَ | يَسْتَأْجِرَا | تَسْتَأْجِرَا | يَسْتَأْجِرُوا | يَسْتَأْجِرْنَ |
      | بيض | 1 | أُبِيضَ | نُبِيضَ | تُبِيضَ | تُبِيضِي | تُبِيضَا | تُبِيضُوا | تُبِضْنَ | يُبِيضَ | تُبِيضَ | يُبِيضَا | تُبِيضَا | يُبِيضُوا | يُبِضْنَ |
      | بيض | 12 | أَبْيَاضَّ | نَبْيَاضَّ | تَبْيَاضَّ | تَبْيَاضِّي | تَبْيَاضَّا | تَبْيَاضُّوا | تَبْيَاضِضْنَ | يَبْيَاضَّ | تَبْيَاضَّ | يَبْيَاضَّا | تَبْيَاضَّا | يَبْيَاضُّوا | يَبْيَاضِضْنَ |
      | بيض | 2 | أُبَيِّضَ | نُبَيِّضَ | تُبَيِّضَ | تُبَيِّضِي | تُبَيِّضَا | تُبَيِّضُوا | تُبَيِّضْنَ | يُبَيِّضَ | تُبَيِّضَ | يُبَيِّضَا | تُبَيِّضَا | يُبَيِّضُوا | يُبَيِّضْنَ |
      | بيض | 3 | أُبَايِضَ | نُبَايِضَ | تُبَايِضَ | تُبَايِضِي | تُبَايِضَا | تُبَايِضُوا | تُبَايِضْنَ | يُبَايِضَ | تُبَايِضَ | يُبَايِضَا | تُبَايِضَا | يُبَايِضُوا | يُبَايِضْنَ |
      | بيض | 5 | أَبْتَاضَ | نَبْتَاضَ | تَبْتَاضَ | تَبْتَاضِي | تَبْتَاضَا | تَبْتَاضُوا | تَبْتَضْنَ | يَبْتَاضَ | تَبْتَاضَ | يَبْتَاضَا | تَبْتَاضَا | يَبْتَاضُوا | يَبْتَضْنَ |
      | بيض | 6 | أَبْيَضَّ | نَبْيَضَّ | تَبْيَضَّ | تَبْيَضِّي | تَبْيَضَّا | تَبْيَضُّوا | تَبْيَضِضْنَ | يَبْيَضَّ | تَبْيَضَّ | يَبْيَضَّا | تَبْيَضَّا | يَبْيَضُّوا | يَبْيَضِضْنَ |
      | بيض | 9 | أَسْتَبِيضَ | نَسْتَبِيضَ | تَسْتَبِيضَ | تَسْتَبِيضِي | تَسْتَبِيضَا | تَسْتَبِيضُوا | تَسْتَبِضْنَ | يَسْتَبِيضَ | تَسْتَبِيضَ | يَسْتَبِيضَا | تَسْتَبِيضَا | يَسْتَبِيضُوا | يَسْتَبِضْنَ |
      | ءكل | 1 | أُوكِلَ | نُؤْكِلَ | تُؤْكِلَ | تُؤْكِلِي | تُؤْكِلا | تُؤْكِلُوا | تُؤْكِلْنَ | يُؤْكِلَ | تُؤْكِلَ | يُؤْكِلا | تُؤْكِلا | يُؤْكِلُوا | يُؤْكِلْنَ |
      | ءكل | 2 | أُؤَكِّلَ | نُؤَكِّلَ | تُؤَكِّلَ | تُؤَكِّلِي | تُؤَكِّلا | تُؤَكِّلُوا | تُؤَكِّلْنَ | يُؤَكِّلَ | تُؤَكِّلَ | يُؤَكِّلا | تُؤَكِّلا | يُؤَكِّلُوا | يُؤَكِّلْنَ |
      | ءكل | 3 | أُؤَاكِلَ | نُؤَاكِلَ | تُؤَاكِلَ | تُؤَاكِلِي | تُؤَاكِلا | تُؤَاكِلُوا | تُؤَاكِلْنَ | يُؤَاكِلَ | تُؤَاكِلَ | يُؤَاكِلا | تُؤَاكِلا | يُؤَاكِلُوا | يُؤَاكِلْنَ |
      | ءكل | 5 | آتَكِلَ | نَأْتَكِلَ | تَأْتَكِلَ | تَأْتَكِلِي | تَأْتَكِلا | تَأْتَكِلُوا | تَأْتَكِلْنَ | يَأْتَكِلَ | تَأْتَكِلَ | يَأْتَكِلا | تَأْتَكِلا | يَأْتَكِلُوا | يَأْتَكِلْنَ |
      | ءكل | 7 | أَتَآكَلَ | نَتَآكَلَ | تَتَآكَلَ | تَتَآكَلِي | تَتَآكَلا | تَتَآكَلُوا | تَتَآكَلْنَ | يَتَآكَلَ | تَتَآكَلَ | يَتَآكَلا | تَتَآكَلا | يَتَآكَلُوا | يَتَآكَلْنَ |
      | ءكل | 8 | أَتَأَكَّلَ | نَتَأَكَّلَ | تَتَأَكَّلَ | تَتَأَكَّلِي | تَتَأَكَّلا | تَتَأَكَّلُوا | تَتَأَكَّلْنَ | يَتَأَكَّلَ | تَتَأَكَّلَ | يَتَأَكَّلا | تَتَأَكَّلا | يَتَأَكَّلُوا | يَتَأَكَّلْنَ |
      | ءكل | 9 | أَسْتَأْكِلَ | نَسْتَأْكِلَ | تَسْتَأْكِلَ | تَسْتَأْكِلِي | تَسْتَأْكِلا | تَسْتَأْكِلُوا | تَسْتَأْكِلْنَ | يَسْتَأْكِلَ | تَسْتَأْكِلَ | يَسْتَأْكِلا | تَسْتَأْكِلا | يَسْتَأْكِلُوا | يَسْتَأْكِلْنَ |
      | جءل | 6 | أَجْأَلَّ | نَجْأَلَّ | تَجْأَلَّ | تَجْأَلِّي | تَجْأَلاَّ | تَجْأَلُّوا | تَجْأَلِلْنَ | يَجْأَلَّ | تَجْأَلَّ | يَجْأَلاَّ | تَجْأَلاَّ | يَجْأَلُّوا | يَجْأَلِلْنَ |
      | ءبن | 2 | أُؤَبِّنَ | نُؤَبِّنَ | تُؤَبِّنَ | تُؤَبِّنِي | تُؤَبِّنَا | تُؤَبِّنُوا | تُؤَبِّنَّ | يُؤَبِّنَ | تُؤَبِّنَ | يُؤَبِّنَا | تُؤَبِّنَا | يُؤَبِّنُوا | يُؤَبِّنَّ |
      | ءبن | 8 | أَتَأَبَّنَ | نَتَأَبَّنَ | تَتَأَبَّنَ | تَتَأَبَّنِي | تَتَأَبَّنَا | تَتَأَبَّنُوا | تَتَأَبَّنَّ | يَتَأَبَّنَ | تَتَأَبَّنَ | يَتَأَبَّنَا | تَتَأَبَّنَا | يَتَأَبَّنُوا | يَتَأَبَّنَّ |
      | ءذن | 1 | أُوذِنَ | نُؤْذِنَ | تُؤْذِنَ | تُؤْذِنِي | تُؤْذِنَا | تُؤْذِنُوا | تُؤْذِنَّ | يُؤْذِنَ | تُؤْذِنَ | يُؤْذِنَا | تُؤْذِنَا | يُؤْذِنُوا | يُؤْذِنَّ |
      | ءذن | 2 | أُؤَذِّنَ | نُؤَذِّنَ | تُؤَذِّنَ | تُؤَذِّنِي | تُؤَذِّنَا | تُؤَذِّنُوا | تُؤَذِّنَّ | يُؤَذِّنَ | تُؤَذِّنَ | يُؤَذِّنَا | تُؤَذِّنَا | يُؤَذِّنُوا | يُؤَذِّنَّ |
      | ءذن | 8 | أَتَأَذَّنَ | نَتَأَذَّنَ | تَتَأَذَّنَ | تَتَأَذَّنِي | تَتَأَذَّنَا | تَتَأَذَّنُوا | تَتَأَذَّنَّ | يَتَأَذَّنَ | تَتَأَذَّنَ | يَتَأَذَّنَا | تَتَأَذَّنَا | يَتَأَذَّنُوا | يَتَأَذَّنَّ |
      | ءذن | 9 | أَسْتَأْذِنَ | نَسْتَأْذِنَ | تَسْتَأْذِنَ | تَسْتَأْذِنِي | تَسْتَأْذِنَا | تَسْتَأْذِنُوا | تَسْتَأْذِنَّ | يَسْتَأْذِنَ | تَسْتَأْذِنَ | يَسْتَأْذِنَا | تَسْتَأْذِنَا | يَسْتَأْذِنُوا | يَسْتَأْذِنَّ |
      | حزو | 8 | أَتَحَزَّى | نَتَحَزَّى | تَتَحَزَّى | تَتَحَزَّيْ | تَتَحَزَّيَا | تَتَحَزَّوْا | تَتَحَزَّيْنَ | يَتَحَزَّى | تَتَحَزَّى | يَتَحَزَّيَا | تَتَحَزَّيَا | يَتَحَزَّوْا | يَتَحَزَّيْنَ |
      | حزو | 10 | أَحْزَوْزِيَ | نَحْزَوْزِيَ | تَحْزَوْزِيَ | تَحْزَوْزِي | تَحْزَوْزِيَا | تَحْزَوْزُوا | تَحْزَوْزِينَ | يَحْزَوْزِيَ | تَحْزَوْزِيَ | يَحْزَوْزِيَا | تَحْزَوْزِيَا | يَحْزَوْزُوا | يَحْزَوْزِينَ |
      | جءي | 11 | أَجْأَوِّيَ | نَجْأَوِّيَ | تَجْأَوِّيَ | تَجْأَوِّي | تَجْأَوِّيَا | تَجْأَوُّوا | تَجْأَوِّينَ | يَجْأَوِّيَ | تَجْأَوِّيَ | يَجْأَوِّيَا | تَجْأَوِّيَا | يَجْأَوُّوا | يَجْأَوِّينَ |
      | جءي | 1 | أُجْئِيَ | نُجْئِيَ | تُجْئِيَ | تُجْئِي | تُجْئِيَا | تُجْؤُوا | تُجْئِينَ | يُجْئِيَ | تُجْئِيَ | يُجْئِيَا | تُجْئِيَا | يُجْؤُوا | يُجْئِينَ |
      | دهم | 1 | أُدْهِمَ | نُدْهِمَ | تُدْهِمَ | تُدْهِمِي | تُدْهِمَا | تُدْهِمُوا | تُدْهِمْنَ | يُدْهِمَ | تُدْهِمَ | يُدْهِمَا | تُدْهِمَا | يُدْهِمُوا | يُدْهِمْنَ |
      | دهم | 12 | أَدْهَامَّ | نَدْهَامَّ | تَدْهَامَّ | تَدْهَامِّي | تَدْهَامَّا | تَدْهَامُّوا | تَدْهَامِمْنَ | يَدْهَامَّ | تَدْهَامَّ | يَدْهَامَّا | تَدْهَامَّا | يَدْهَامُّوا | يَدْهَامِمْنَ |
      | دهم | 2 | أُدَهِّمَ | نُدَهِّمَ | تُدَهِّمَ | تُدَهِّمِي | تُدَهِّمَا | تُدَهِّمُوا | تُدَهِّمْنَ | يُدَهِّمَ | تُدَهِّمَ | يُدَهِّمَا | تُدَهِّمَا | يُدَهِّمُوا | يُدَهِّمْنَ |
      | دهم | 6 | أَدْهَمَّ | نَدْهَمَّ | تَدْهَمَّ | تَدْهَمِّي | تَدْهَمَّا | تَدْهَمُّوا | تَدْهَمِمْنَ | يَدْهَمَّ | تَدْهَمَّ | يَدْهَمَّا | تَدْهَمَّا | يَدْهَمُّوا | يَدْهَمِمْنَ |
      | دهم | 8 | أَتَدَهَّمَ | نَتَدَهَّمَ | تَتَدَهَّمَ | تَتَدَهَّمِي | تَتَدَهَّمَا | تَتَدَهَّمُوا | تَتَدَهَّمْنَ | يَتَدَهَّمَ | تَتَدَهَّمَ | يَتَدَهَّمَا | تَتَدَهَّمَا | يَتَدَهَّمُوا | يَتَدَهَّمْنَ |
      | بلج | 1 | أُبْلِجَ | نُبْلِجَ | تُبْلِجَ | تُبْلِجِي | تُبْلِجَا | تُبْلِجُوا | تُبْلِجْنَ | يُبْلِجَ | تُبْلِجَ | يُبْلِجَا | تُبْلِجَا | يُبْلِجُوا | يُبْلِجْنَ |
      | بلج | 12 | أَبْلاجَّ | نَبْلاجَّ | تَبْلاجَّ | تَبْلاجِّي | تَبْلاجَّا | تَبْلاجُّوا | تَبْلاجِجْنَ | يَبْلاجَّ | تَبْلاجَّ | يَبْلاجَّا | تَبْلاجَّا | يَبْلاجُّوا | يَبْلاجِجْنَ |
      | بلج | 4 | أَنْبَلِجَ | نَنْبَلِجَ | تَنْبَلِجَ | تَنْبَلِجِي | تَنْبَلِجَا | تَنْبَلِجُوا | تَنْبَلِجْنَ | يَنْبَلِجَ | تَنْبَلِجَ | يَنْبَلِجَا | تَنْبَلِجَا | يَنْبَلِجُوا | يَنْبَلِجْنَ |
      | بلج | 5 | أَبْتَلِجَ | نَبْتَلِجَ | تَبْتَلِجَ | تَبْتَلِجِي | تَبْتَلِجَا | تَبْتَلِجُوا | تَبْتَلِجْنَ | يَبْتَلِجَ | تَبْتَلِجَ | يَبْتَلِجَا | تَبْتَلِجَا | يَبْتَلِجُوا | يَبْتَلِجْنَ |
      | بلج | 8 | أَتَبَلَّجَ | نَتَبَلَّجَ | تَتَبَلَّجَ | تَتَبَلَّجِي | تَتَبَلَّجَا | تَتَبَلَّجُوا | تَتَبَلَّجْنَ | يَتَبَلَّجَ | تَتَبَلَّجَ | يَتَبَلَّجَا | تَتَبَلَّجَا | يَتَبَلَّجُوا | يَتَبَلَّجْنَ |
      | قبل | 1 | أُقْبِلَ | نُقْبِلَ | تُقْبِلَ | تُقْبِلِي | تُقْبِلا | تُقْبِلُوا | تُقْبِلْنَ | يُقْبِلَ | تُقْبِلَ | يُقْبِلا | تُقْبِلا | يُقْبِلُوا | يُقْبِلْنَ |
      | قبل | 12 | أَقْبَالَّ | نَقْبَالَّ | تَقْبَالَّ | تَقْبَالِّي | تَقْبَالاَّ | تَقْبَالُّوا | تَقْبَالِلْنَ | يَقْبَالَّ | تَقْبَالَّ | يَقْبَالاَّ | تَقْبَالاَّ | يَقْبَالُّوا | يَقْبَالِلْنَ |
      | قبل | 2 | أُقَبِّلَ | نُقَبِّلَ | تُقَبِّلَ | تُقَبِّلِي | تُقَبِّلا | تُقَبِّلُوا | تُقَبِّلْنَ | يُقَبِّلَ | تُقَبِّلَ | يُقَبِّلا | تُقَبِّلا | يُقَبِّلُوا | يُقَبِّلْنَ |
      | قبل | 3 | أُقَابِلَ | نُقَابِلَ | تُقَابِلَ | تُقَابِلِي | تُقَابِلا | تُقَابِلُوا | تُقَابِلْنَ | يُقَابِلَ | تُقَابِلَ | يُقَابِلا | تُقَابِلا | يُقَابِلُوا | يُقَابِلْنَ |
      | قبل | 5 | أَقْتَبِلَ | نَقْتَبِلَ | تَقْتَبِلَ | تَقْتَبِلِي | تَقْتَبِلا | تَقْتَبِلُوا | تَقْتَبِلْنَ | يَقْتَبِلَ | تَقْتَبِلَ | يَقْتَبِلا | تَقْتَبِلا | يَقْتَبِلُوا | يَقْتَبِلْنَ |
      | قبل | 6 | أَقْبَلَّ | نَقْبَلَّ | تَقْبَلَّ | تَقْبَلِّي | تَقْبَلاَّ | تَقْبَلُّوا | تَقْبَلِلْنَ | يَقْبَلَّ | تَقْبَلَّ | يَقْبَلاَّ | تَقْبَلاَّ | يَقْبَلُّوا | يَقْبَلِلْنَ |
      | قبل | 7 | أَتَقَابَلَ | نَتَقَابَلَ | تَتَقَابَلَ | تَتَقَابَلِي | تَتَقَابَلا | تَتَقَابَلُوا | تَتَقَابَلْنَ | يَتَقَابَلَ | تَتَقَابَلَ | يَتَقَابَلا | تَتَقَابَلا | يَتَقَابَلُوا | يَتَقَابَلْنَ |
      | قبل | 8 | أَتَقَبَّلَ | نَتَقَبَّلَ | تَتَقَبَّلَ | تَتَقَبَّلِي | تَتَقَبَّلا | تَتَقَبَّلُوا | تَتَقَبَّلْنَ | يَتَقَبَّلَ | تَتَقَبَّلَ | يَتَقَبَّلا | تَتَقَبَّلا | يَتَقَبَّلُوا | يَتَقَبَّلْنَ |
      | قبل | 9 | أَسْتَقْبِلَ | نَسْتَقْبِلَ | تَسْتَقْبِلَ | تَسْتَقْبِلِي | تَسْتَقْبِلا | تَسْتَقْبِلُوا | تَسْتَقْبِلْنَ | يَسْتَقْبِلَ | تَسْتَقْبِلَ | يَسْتَقْبِلا | تَسْتَقْبِلا | يَسْتَقْبِلُوا | يَسْتَقْبِلْنَ |
      | ءيس | 2 | أُؤَيِّسَ | نُؤَيِّسَ | تُؤَيِّسَ | تُؤَيِّسِي | تُؤَيِّسَا | تُؤَيِّسُوا | تُؤَيِّسْنَ | يُؤَيِّسَ | تُؤَيِّسَ | يُؤَيِّسَا | تُؤَيِّسَا | يُؤَيِّسُوا | يُؤَيِّسْنَ |
      | ءيس | 8 | أَتَأَيَّسَ | نَتَأَيَّسَ | تَتَأَيَّسَ | تَتَأَيَّسِي | تَتَأَيَّسَا | تَتَأَيَّسُوا | تَتَأَيَّسْنَ | يَتَأَيَّسَ | تَتَأَيَّسَ | يَتَأَيَّسَا | تَتَأَيَّسَا | يَتَأَيَّسُوا | يَتَأَيَّسْنَ |
      | صبر | 1 | أُصْبِرَ | نُصْبِرَ | تُصْبِرَ | تُصْبِرِي | تُصْبِرَا | تُصْبِرُوا | تُصْبِرْنَ | يُصْبِرَ | تُصْبِرَ | يُصْبِرَا | تُصْبِرَا | يُصْبِرُوا | يُصْبِرْنَ |
      | صبر | 12 | أَصْبَارَّ | نَصْبَارَّ | تَصْبَارَّ | تَصْبَارِّي | تَصْبَارَّا | تَصْبَارُّوا | تَصْبَارِرْنَ | يَصْبَارَّ | تَصْبَارَّ | يَصْبَارَّا | تَصْبَارَّا | يَصْبَارُّوا | يَصْبَارِرْنَ |
      | صبر | 2 | أُصَبِّرَ | نُصَبِّرَ | تُصَبِّرَ | تُصَبِّرِي | تُصَبِّرَا | تُصَبِّرُوا | تُصَبِّرْنَ | يُصَبِّرَ | تُصَبِّرَ | يُصَبِّرَا | تُصَبِّرَا | يُصَبِّرُوا | يُصَبِّرْنَ |
      | صبر | 3 | أُصَابِرَ | نُصَابِرَ | تُصَابِرَ | تُصَابِرِي | تُصَابِرَا | تُصَابِرُوا | تُصَابِرْنَ | يُصَابِرَ | تُصَابِرَ | يُصَابِرَا | تُصَابِرَا | يُصَابِرُوا | يُصَابِرْنَ |
      | صبر | 5 | أَصْطَبِرَ | نَصْطَبِرَ | تَصْطَبِرَ | تَصْطَبِرِي | تَصْطَبِرَا | تَصْطَبِرُوا | تَصْطَبِرْنَ | يَصْطَبِرَ | تَصْطَبِرَ | يَصْطَبِرَا | تَصْطَبِرَا | يَصْطَبِرُوا | يَصْطَبِرْنَ |
      | صبر | 8 | أَتَصَبَّرَ | نَتَصَبَّرَ | تَتَصَبَّرَ | تَتَصَبَّرِي | تَتَصَبَّرَا | تَتَصَبَّرُوا | تَتَصَبَّرْنَ | يَتَصَبَّرَ | تَتَصَبَّرَ | يَتَصَبَّرَا | تَتَصَبَّرَا | يَتَصَبَّرُوا | يَتَصَبَّرْنَ |
      | صبر | 9 | أَسْتَصْبِرَ | نَسْتَصْبِرَ | تَسْتَصْبِرَ | تَسْتَصْبِرِي | تَسْتَصْبِرَا | تَسْتَصْبِرُوا | تَسْتَصْبِرْنَ | يَسْتَصْبِرَ | تَسْتَصْبِرَ | يَسْتَصْبِرَا | تَسْتَصْبِرَا | يَسْتَصْبِرُوا | يَسْتَصْبِرْنَ |
      | نتء | 5 | أَنْتَتِئَ | نَنْتَتِئَ | تَنْتَتِئَ | تَنْتَتِئِي | تَنْتَتِئَا | تَنْتَتِئُوا | تَنْتَتِئْنَ | يَنْتَتِئَ | تَنْتَتِئَ | يَنْتَتِئَا | تَنْتَتِئَا | يَنْتَتِئُوا | يَنْتَتِئْنَ |
      | ختو | 1 | أُخْتِيَ | نُخْتِيَ | تُخْتِيَ | تُخْتِي | تُخْتِيَا | تُخْتُوا | تُخْتِينَ | يُخْتِيَ | تُخْتِيَ | يُخْتِيَا | تُخْتِيَا | يُخْتُوا | يُخْتِينَ |
      | ختو | 5 | أَخْتَتِيَ | نَخْتَتِيَ | تَخْتَتِيَ | تَخْتَتِي | تَخْتَتِيَا | تَخْتَتُوا | تَخْتَتِينَ | يَخْتَتِيَ | تَخْتَتِيَ | يَخْتَتِيَا | تَخْتَتِيَا | يَخْتَتُوا | يَخْتَتِينَ |
      | نءي | 1 | أُنْئِيَ | نُنْئِيَ | تُنْئِيَ | تُنْئِي | تُنْئِيَا | تُنْؤُوا | تُنْئِينَ | يُنْئِيَ | تُنْئِيَ | يُنْئِيَا | تُنْئِيَا | يُنْؤُوا | يُنْئِينَ |
      | نءي | 3 | أُنَائِيَ | نُنَائِيَ | تُنَائِيَ | تُنَائِي | تُنَائِيَا | تُنَاؤُوا | تُنَائِينَ | يُنَائِيَ | تُنَائِيَ | يُنَائِيَا | تُنَائِيَا | يُنَاؤُوا | يُنَائِينَ |
      | نءي | 5 | أَنْتَئِيَ | نَنْتَئِيَ | تَنْتَئِيَ | تَنْتَئِي | تَنْتَئِيَا | تَنْتَؤُوا | تَنْتَئِينَ | يَنْتَئِيَ | تَنْتَئِيَ | يَنْتَئِيَا | تَنْتَئِيَا | يَنْتَؤُوا | يَنْتَئِينَ |
      | نءي | 7 | أَتَنَاءَى | نَتَنَاءَى | تَتَنَاءَى | تَتَنَاءَيْ | تَتَنَاءَيَا | تَتَنَاءَوْا | تَتَنَاءَيْنَ | يَتَنَاءَى | تَتَنَاءَى | يَتَنَاءَيَا | تَتَنَاءَيَا | يَتَنَاءَوْا | يَتَنَاءَيْنَ |
      | دخر | 1 | أُدْخِرَ | نُدْخِرَ | تُدْخِرَ | تُدْخِرِي | تُدْخِرَا | تُدْخِرُوا | تُدْخِرْنَ | يُدْخِرَ | تُدْخِرَ | يُدْخِرَا | تُدْخِرَا | يُدْخِرُوا | يُدْخِرْنَ |
      | دخر | 5 | أَدَّخِرَ | نَدَّخِرَ | تَدَّخِرَ | تَدَّخِرِي | تَدَّخِرَا | تَدَّخِرُوا | تَدَّخِرْنَ | يَدَّخِرَ | تَدَّخِرَ | يَدَّخِرَا | تَدَّخِرَا | يَدَّخِرُوا | يَدَّخِرْنَ |
      | ملح | 1 | أُمْلِحَ | نُمْلِحَ | تُمْلِحَ | تُمْلِحِي | تُمْلِحَا | تُمْلِحُوا | تُمْلِحْنَ | يُمْلِحَ | تُمْلِحَ | يُمْلِحَا | تُمْلِحَا | يُمْلِحُوا | يُمْلِحْنَ |
      | ملح | 12 | أَمْلاحَّ | نَمْلاحَّ | تَمْلاحَّ | تَمْلاحِّي | تَمْلاحَّا | تَمْلاحُّوا | تَمْلاحِحْنَ | يَمْلاحَّ | تَمْلاحَّ | يَمْلاحَّا | تَمْلاحَّا | يَمْلاحُّوا | يَمْلاحِحْنَ |
      | ملح | 2 | أُمَلِّحَ | نُمَلِّحَ | تُمَلِّحَ | تُمَلِّحِي | تُمَلِّحَا | تُمَلِّحُوا | تُمَلِّحْنَ | يُمَلِّحَ | تُمَلِّحَ | يُمَلِّحَا | تُمَلِّحَا | يُمَلِّحُوا | يُمَلِّحْنَ |
      | ملح | 3 | أُمَالِحَ | نُمَالِحَ | تُمَالِحَ | تُمَالِحِي | تُمَالِحَا | تُمَالِحُوا | تُمَالِحْنَ | يُمَالِحَ | تُمَالِحَ | يُمَالِحَا | تُمَالِحَا | يُمَالِحُوا | يُمَالِحْنَ |
      | ملح | 5 | أَمْتَلِحَ | نَمْتَلِحَ | تَمْتَلِحَ | تَمْتَلِحِي | تَمْتَلِحَا | تَمْتَلِحُوا | تَمْتَلِحْنَ | يَمْتَلِحَ | تَمْتَلِحَ | يَمْتَلِحَا | تَمْتَلِحَا | يَمْتَلِحُوا | يَمْتَلِحْنَ |
      | ملح | 6 | أَمْلَحَّ | نَمْلَحَّ | تَمْلَحَّ | تَمْلَحِّي | تَمْلَحَّا | تَمْلَحُّوا | تَمْلَحِحْنَ | يَمْلَحَّ | تَمْلَحَّ | يَمْلَحَّا | تَمْلَحَّا | يَمْلَحُّوا | يَمْلَحِحْنَ |
      | ملح | 8 | أَتَمَلَّحَ | نَتَمَلَّحَ | تَتَمَلَّحَ | تَتَمَلَّحِي | تَتَمَلَّحَا | تَتَمَلَّحُوا | تَتَمَلَّحْنَ | يَتَمَلَّحَ | تَتَمَلَّحَ | يَتَمَلَّحَا | تَتَمَلَّحَا | يَتَمَلَّحُوا | يَتَمَلَّحْنَ |
      | ملح | 9 | أَسْتَمْلِحَ | نَسْتَمْلِحَ | تَسْتَمْلِحَ | تَسْتَمْلِحِي | تَسْتَمْلِحَا | تَسْتَمْلِحُوا | تَسْتَمْلِحْنَ | يَسْتَمْلِحَ | تَسْتَمْلِحَ | يَسْتَمْلِحَا | تَسْتَمْلِحَا | يَسْتَمْلِحُوا | يَسْتَمْلِحْنَ |
      | شءم | 1 | أُشْئِمَ | نُشْئِمَ | تُشْئِمَ | تُشْئِمِي | تُشْئِمَا | تُشْئِمُوا | تُشْئِمْنَ | يُشْئِمَ | تُشْئِمَ | يُشْئِمَا | تُشْئِمَا | يُشْئِمُوا | يُشْئِمْنَ |
      | شءم | 2 | أُشَئِّمَ | نُشَئِّمَ | تُشَئِّمَ | تُشَئِّمِي | تُشَئِّمَا | تُشَئِّمُوا | تُشَئِّمْنَ | يُشَئِّمَ | تُشَئِّمَ | يُشَئِّمَا | تُشَئِّمَا | يُشَئِّمُوا | يُشَئِّمْنَ |
      | شءم | 3 | أُشَائِمَ | نُشَائِمَ | تُشَائِمَ | تُشَائِمِي | تُشَائِمَا | تُشَائِمُوا | تُشَائِمْنَ | يُشَائِمَ | تُشَائِمَ | يُشَائِمَا | تُشَائِمَا | يُشَائِمُوا | يُشَائِمْنَ |
      | شءم | 7 | أَتَشَاءَمَ | نَتَشَاءَمَ | تَتَشَاءَمَ | تَتَشَاءَمِي | تَتَشَاءَمَا | تَتَشَاءَمُوا | تَتَشَاءَمْنَ | يَتَشَاءَمَ | تَتَشَاءَمَ | يَتَشَاءَمَا | تَتَشَاءَمَا | يَتَشَاءَمُوا | يَتَشَاءَمْنَ |
      | شءم | 8 | أَتَشَأَّمَ | نَتَشَأَّمَ | تَتَشَأَّمَ | تَتَشَأَّمِي | تَتَشَأَّمَا | تَتَشَأَّمُوا | تَتَشَأَّمْنَ | يَتَشَأَّمَ | تَتَشَأَّمَ | يَتَشَأَّمَا | تَتَشَأَّمَا | يَتَشَأَّمُوا | يَتَشَأَّمْنَ |
      | شءم | 9 | أَسْتَشْئِمَ | نَسْتَشْئِمَ | تَسْتَشْئِمَ | تَسْتَشْئِمِي | تَسْتَشْئِمَا | تَسْتَشْئِمُوا | تَسْتَشْئِمْنَ | يَسْتَشْئِمَ | تَسْتَشْئِمَ | يَسْتَشْئِمَا | تَسْتَشْئِمَا | يَسْتَشْئِمُوا | يَسْتَشْئِمْنَ |
      | يقظ | 1 | أُوقِظَ | نُوقِظَ | تُوقِظَ | تُوقِظِي | تُوقِظَا | تُوقِظُوا | تُوقِظْنَ | يُوقِظَ | تُوقِظَ | يُوقِظَا | تُوقِظَا | يُوقِظُوا | يُوقِظْنَ |
      | يقظ | 2 | أُيَقِّظَ | نُيَقِّظَ | تُيَقِّظَ | تُيَقِّظِي | تُيَقِّظَا | تُيَقِّظُوا | تُيَقِّظْنَ | يُيَقِّظَ | تُيَقِّظَ | يُيَقِّظَا | تُيَقِّظَا | يُيَقِّظُوا | يُيَقِّظْنَ |
      | يقظ | 8 | أَتَيَقَّظَ | نَتَيَقَّظَ | تَتَيَقَّظَ | تَتَيَقَّظِي | تَتَيَقَّظَا | تَتَيَقَّظُوا | تَتَيَقَّظْنَ | يَتَيَقَّظَ | تَتَيَقَّظَ | يَتَيَقَّظَا | تَتَيَقَّظَا | يَتَيَقَّظُوا | يَتَيَقَّظْنَ |
      | يقظ | 9 | أَسْتَيْقِظَ | نَسْتَيْقِظَ | تَسْتَيْقِظَ | تَسْتَيْقِظِي | تَسْتَيْقِظَا | تَسْتَيْقِظُوا | تَسْتَيْقِظْنَ | يَسْتَيْقِظَ | تَسْتَيْقِظَ | يَسْتَيْقِظَا | تَسْتَيْقِظَا | يَسْتَيْقِظُوا | يَسْتَيْقِظْنَ |
      | ءسو | 2 | أُؤَسِّيَ | نُؤَسِّيَ | تُؤَسِّيَ | تُؤَسِّي | تُؤَسِّيَا | تُؤَسُّوا | تُؤَسِّينَ | يُؤَسِّيَ | تُؤَسِّيَ | يُؤَسِّيَا | تُؤَسِّيَا | يُؤَسُّوا | يُؤَسِّينَ |
      | ءسو | 3 | أُؤَاسِيَ | نُؤَاسِيَ | تُؤَاسِيَ | تُؤَاسِي | تُؤَاسِيَا | تُؤَاسُوا | تُؤَاسِينَ | يُؤَاسِيَ | تُؤَاسِيَ | يُؤَاسِيَا | تُؤَاسِيَا | يُؤَاسُوا | يُؤَاسِينَ |
      | ءسو | 5 | آتَسِيَ | نَأْتَسِيَ | تَأْتَسِيَ | تَأْتَسِي | تَأْتَسِيَا | تَأْتَسُوا | تَأْتَسِينَ | يَأْتَسِيَ | تَأْتَسِيَ | يَأْتَسِيَا | تَأْتَسِيَا | يَأْتَسُوا | يَأْتَسِينَ |
      | ءسو | 7 | أَتَآسَى | نَتَآسَى | تَتَآسَى | تَتَآسَيْ | تَتَآسَيَا | تَتَآسَوْا | تَتَآسَيْنَ | يَتَآسَى | تَتَآسَى | يَتَآسَيَا | تَتَآسَيَا | يَتَآسَوْا | يَتَآسَيْنَ |
      | ءسو | 8 | أَتَأَسَّى | نَتَأَسَّى | تَتَأَسَّى | تَتَأَسَّيْ | تَتَأَسَّيَا | تَتَأَسَّوْا | تَتَأَسَّيْنَ | يَتَأَسَّى | تَتَأَسَّى | يَتَأَسَّيَا | تَتَأَسَّيَا | يَتَأَسَّوْا | يَتَأَسَّيْنَ |
      | ءسي | 1 | أُوسِيَ | نُؤْسِيَ | تُؤْسِيَ | تُؤْسِي | تُؤْسِيَا | تُؤْسُوا | تُؤْسِينَ | يُؤْسِيَ | تُؤْسِيَ | يُؤْسِيَا | تُؤْسِيَا | يُؤْسُوا | يُؤْسِينَ |
      | ءسي | 3 | أُؤَاسِيَ | نُؤَاسِيَ | تُؤَاسِيَ | تُؤَاسِي | تُؤَاسِيَا | تُؤَاسُوا | تُؤَاسِينَ | يُؤَاسِيَ | تُؤَاسِيَ | يُؤَاسِيَا | تُؤَاسِيَا | يُؤَاسُوا | يُؤَاسِينَ |
      | ءضض | 3 | أُؤَاضَّ | نُؤَاضَّ | تُؤَاضَّ | تُؤَاضِّي | تُؤَاضَّا | تُؤَاضُّوا | تُؤَاضِضْنَ | يُؤَاضَّ | تُؤَاضَّ | يُؤَاضَّا | تُؤَاضَّا | يُؤَاضُّوا | يُؤَاضِضْنَ |
      | ءضض | 5 | آتَضَّ | نَأْتَضَّ | تَأْتَضَّ | تَأْتَضِّي | تَأْتَضَّا | تَأْتَضُّوا | تَأْتَضِضْنَ | يَأْتَضَّ | تَأْتَضَّ | يَأْتَضَّا | تَأْتَضَّا | يَأْتَضُّوا | يَأْتَضِضْنَ |
      | حوي | 2 | أُحَوِّيَ | نُحَوِّيَ | تُحَوِّيَ | تُحَوِّي | تُحَوِّيَا | تُحَوُّوا | تُحَوِّينَ | يُحَوِّيَ | تُحَوِّيَ | يُحَوِّيَا | تُحَوِّيَا | يُحَوُّوا | يُحَوِّينَ |
      | حوي | 5 | أَحْتَوِيَ | نَحْتَوِيَ | تَحْتَوِيَ | تَحْتَوِي | تَحْتَوِيَا | تَحْتَوُوا | تَحْتَوِينَ | يَحْتَوِيَ | تَحْتَوِيَ | يَحْتَوِيَا | تَحْتَوِيَا | يَحْتَوُوا | يَحْتَوِينَ |
      | حوي | 8 | أَتَحَوَّى | نَتَحَوَّى | تَتَحَوَّى | تَتَحَوَّيْ | تَتَحَوَّيَا | تَتَحَوَّوْا | تَتَحَوَّيْنَ | يَتَحَوَّى | تَتَحَوَّى | يَتَحَوَّيَا | تَتَحَوَّيَا | يَتَحَوَّوْا | يَتَحَوَّيْنَ |
      | حيي | 1 | أُحْيِيَ | نُحْيِيَ | تُحْيِيَ | تُحْيِي | تُحْيِيَا | تُحْيُوا | تُحْيِينَ | يُحْيِيَ | تُحْيِيَ | يُحْيِيَا | تُحْيِيَا | يُحْيُوا | يُحْيِينَ |
      | حيي | 2 | أُحَيِّيَ | نُحَيِّيَ | تُحَيِّيَ | تُحَيِّي | تُحَيِّيَا | تُحَيُّوا | تُحَيِّينَ | يُحَيِّيَ | تُحَيِّيَ | يُحَيِّيَا | تُحَيِّيَا | يُحَيُّوا | يُحَيِّينَ |
      | حيي | 3 | أُحَايِيَ | نُحَايِيَ | تُحَايِيَ | تُحَايِي | تُحَايِيَا | تُحَايُوا | تُحَايِينَ | يُحَايِيَ | تُحَايِيَ | يُحَايِيَا | تُحَايِيَا | يُحَايُوا | يُحَايِينَ |
      | حيي | 7 | أَتَحَايَا | نَتَحَايَا | تَتَحَايَا | تَتَحَايَيْ | تَتَحَايَيَا | تَتَحَايَوْا | تَتَحَايَيْنَ | يَتَحَايَا | تَتَحَايَا | يَتَحَايَيَا | تَتَحَايَيَا | يَتَحَايَوْا | يَتَحَايَيْنَ |
      | حيي | 8 | أَتَحَيَّا | نَتَحَيَّا | تَتَحَيَّا | تَتَحَيَّيْ | تَتَحَيَّيَا | تَتَحَيَّوْا | تَتَحَيَّيْنَ | يَتَحَيَّا | تَتَحَيَّا | يَتَحَيَّيَا | تَتَحَيَّيَا | يَتَحَيَّوْا | يَتَحَيَّيْنَ |
      | حيي | 9 | أَسْتَحْيِيَ | نَسْتَحْيِيَ | تَسْتَحْيِيَ | تَسْتَحْيِي | تَسْتَحْيِيَا | تَسْتَحْيُوا | تَسْتَحْيِينَ | يَسْتَحْيِيَ | تَسْتَحْيِيَ | يَسْتَحْيِيَا | تَسْتَحْيِيَا | يَسْتَحْيُوا | يَسْتَحْيِينَ |
