###
# /*
# *
# * MIT License
# *
# * Copyright (c) 2021 Abdalaziz Alsaydi
# *
# * Permission is hereby granted, free of charge, to any person obtaining a copy
# * of this software and associated documentation files (the "Software"), to deal
# * in the Software without restriction, including without limitation the rights
# * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
# * copies of the Software, and to permit persons to whom the Software is
# * furnished to do so, subject to the following conditions:
# *
# * The above copyright notice and this permission notice shall be included in all
# * copies or substantial portions of the Software.
# *
# * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
# * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
# * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
# * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
# * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
# * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
# * SOFTWARE.
# */

Feature: تصريف اسم الفاعل من الفعل الرباعي المزيد

  Scenario Outline: augmented quadrilateral active participle
    Given an augmented verb
    When the derived noun is from an augmented quad verb is "ActiveParticiple"
    Then singular masculine nouns of the quad verb "<verb>" of formula "<formula>" are nominative "<m_single_n>" and accusative "<m_single_a>" and genitive "<m_single_g>"
    And  singular feminine nouns of the quad verb "<verb>" of formula "<formula>" are nominative "<f_single_n>" and accusative "<f_single_a>" and genitive "<f_single_g>"
    And  dual masculine nouns of the quad verb "<verb>" of formula "<formula>" are nominative "<m_dual_n>" and accusative "<m_dual_a>" and genitive "<m_dual_g>"
    And  dual feminine nouns of the quad verb "<verb>" of formula "<formula>" are nominative "<f_dual_n>" and accusative "<f_dual_a>" and genitive "<f_dual_g>"
    And  plural masculine nouns of the quad verb "<verb>" of formula "<formula>" are nominative "<m_plural_n>" and accusative "<m_plural_a>" and genitive "<m_plural_g>"
    And  plural feminine nouns of the quad verb "<verb>" of formula "<formula>" are nominative "<f_plural_n>" and accusative "<f_plural_a>" and genitive "<f_plural_g>"
    Examples:
      | verb | formula | m_single_n   | f_single_n     | m_dual_n        | f_dual_n          | m_plural_n      | f_plural_n      | m_single_a    | f_single_a     | m_dual_a         | f_dual_a           | m_plural_a      | f_plural_a      | m_single_g   | f_single_g     | m_dual_g         | f_dual_g           | m_plural_g      | f_plural_g      |
      | دحرج | 1 | مُتَدَحْرِجٌ | مُتَدَحْرِجَةٌ | مُتَدَحْرِجَانِ | مُتَدَحْرِجَتَانِ | مُتَدَحْرِجُونَ | مُتَدَحْرِجَاتٌ | مُتَدَحْرِجًا | مُتَدَحْرِجَةً | مُتَدَحْرِجَيْنِ | مُتَدَحْرِجَتَيْنِ | مُتَدَحْرِجِينَ | مُتَدَحْرِجَاتٍ | مُتَدَحْرِجٍ | مُتَدَحْرِجَةٍ | مُتَدَحْرِجَيْنِ | مُتَدَحْرِجَتَيْنِ | مُتَدَحْرِجِينَ | مُتَدَحْرِجَاتٍ |
      | بلور | 1 | مُتَبَلْوِرٌ | مُتَبَلْوِرَةٌ | مُتَبَلْوِرَانِ | مُتَبَلْوِرَتَانِ | مُتَبَلْوِرُونَ | مُتَبَلْوِرَاتٌ | مُتَبَلْوِرًا | مُتَبَلْوِرَةً | مُتَبَلْوِرَيْنِ | مُتَبَلْوِرَتَيْنِ | مُتَبَلْوِرِينَ | مُتَبَلْوِرَاتٍ | مُتَبَلْوِرٍ | مُتَبَلْوِرَةٍ | مُتَبَلْوِرَيْنِ | مُتَبَلْوِرَتَيْنِ | مُتَبَلْوِرِينَ | مُتَبَلْوِرَاتٍ |
      | جءجء | 1 | مُتَجَأْجِئٌ | مُتَجَأْجِئَةٌ | مُتَجَأْجِئَانِ | مُتَجَأْجِئَتَانِ | مُتَجَأْجِئُونَ | مُتَجَأْجِئَاتٌ | مُتَجَأْجِئًا | مُتَجَأْجِئَةً | مُتَجَأْجِئَيْنِ | مُتَجَأْجِئَتَيْنِ | مُتَجَأْجِئِينَ | مُتَجَأْجِئَاتٍ | مُتَجَأْجِئٍ | مُتَجَأْجِئَةٍ | مُتَجَأْجِئَيْنِ | مُتَجَأْجِئَتَيْنِ | مُتَجَأْجِئِينَ | مُتَجَأْجِئَاتٍ |
      | رهيء | 1 | مُتَرَهْيِئٌ | مُتَرَهْيِئَةٌ | مُتَرَهْيِئَانِ | مُتَرَهْيِئَتَانِ | مُتَرَهْيِئُونَ | مُتَرَهْيِئَاتٌ | مُتَرَهْيِئًا | مُتَرَهْيِئَةً | مُتَرَهْيِئَيْنِ | مُتَرَهْيِئَتَيْنِ | مُتَرَهْيِئِينَ | مُتَرَهْيِئَاتٍ | مُتَرَهْيِئٍ | مُتَرَهْيِئَةٍ | مُتَرَهْيِئَيْنِ | مُتَرَهْيِئَتَيْنِ | مُتَرَهْيِئِينَ | مُتَرَهْيِئَاتٍ |
      | زلزل | 1 | مُتَزَلْزِلٌ | مُتَزَلْزِلَةٌ | مُتَزَلْزِلانِ | مُتَزَلْزِلَتَانِ | مُتَزَلْزِلُونَ | مُتَزَلْزِلاتٌ | مُتَزَلْزِلاً | مُتَزَلْزِلَةً | مُتَزَلْزِلَيْنِ | مُتَزَلْزِلَتَيْنِ | مُتَزَلْزِلِينَ | مُتَزَلْزِلاتٍ | مُتَزَلْزِلٍ | مُتَزَلْزِلَةٍ | مُتَزَلْزِلَيْنِ | مُتَزَلْزِلَتَيْنِ | مُتَزَلْزِلِينَ | مُتَزَلْزِلَاتٍ |
      | سيطر | 1 | مُتَسَيْطِرٌ | مُتَسَيْطِرَةٌ | مُتَسَيْطِرَانِ | مُتَسَيْطِرَتَانِ | مُتَسَيْطِرُونَ | مُتَسَيْطِرَاتٌ | مُتَسَيْطِرًا | مُتَسَيْطِرَةً | مُتَسَيْطِرَيْنِ | مُتَسَيْطِرَتَيْنِ | مُتَسَيْطِرِينَ | مُتَسَيْطِرَاتٍ | مُتَسَيْطِرٍ | مُتَسَيْطِرَةٍ | مُتَسَيْطِرَيْنِ | مُتَسَيْطِرَتَيْنِ | مُتَسَيْطِرِينَ | مُتَسَيْطِرَاتٍ |
      | طمءن | 1 | مُتَطَمْئِنٌ | مُتَطَمْئِنَةٌ | مُتَطَمْئِنَانِ | مُتَطَمْئِنَتَانِ | مُتَطَمْئِنُونَ | مُتَطَمْئِنَاتٌ | مُتَطَمْئِنًا | مُتَطَمْئِنَةً | مُتَطَمْئِنَيْنِ | مُتَطَمْئِنَتَيْنِ | مُتَطَمْئِنِينَ | مُتَطَمْئِنَاتٍ | مُتَطَمْئِنٍ | مُتَطَمْئِنَةٍ | مُتَطَمْئِنَيْنِ | مُتَطَمْئِنَتَيْنِ | مُتَطَمْئِنِينَ | مُتَطَمْئِنَاتٍ |
      | طمءن | 3 | مُطْمَئِنٌّ | مُطْمَئِنَّةٌ | مُطْمَئِنَّانِ | مُطْمَئِنَّتَانِ | مُطْمَئِنُّونَ | مُطْمَئِنَّاتٌ | مُطْمَئِنًّا | مُطْمَئِنَّةً | مُطْمَئِنَّيْنِ | مُطْمَئِنَّتَيْنِ | مُطْمَئِنِّينَ | مُطْمَئِنَّاتٍ | مُطْمَئِنٍّ | مُطْمَئِنَّةٍ | مُطْمَئِنَّيْنِ | مُطْمَئِنَّتَيْنِ | مُطْمَئِنِّينَ | مُطْمَئِنَّاتٍ |
      | قلسي | 1 | مُتَقَلْسٍ | مُتَقَلْسِيَةٌ | مُتَقَلْسِيَانِ | مُتَقَلْسِيَتَانِ | مُتَقَلْسُونَ | مُتَقَلْسِيَاتٌ | مُتَقَلْسِيًا | مُتَقَلْسِيَةً | مُتَقَلْسِيَيْنِ | مُتَقَلْسِيَتَيْنِ | مُتَقَلْسِينَ | مُتَقَلْسِيَاتٍ | مُتَقَلْسٍ | مُتَقَلْسِيَةٍ | مُتَقَلْسِيَيْنِ | مُتَقَلْسِيَتَيْنِ | مُتَقَلْسِينَ | مُتَقَلْسِيَاتٍ |
      | شرءب | 3 | مُشْرَئِبٌّ | مُشْرَئِبَّةٌ | مُشْرَئِبَّانِ | مُشْرَئِبَّتَانِ | مُشْرَئِبُّونَ | مُشْرَئِبَّاتٌ | مُشْرَئِبًّا | مُشْرَئِبَّةً | مُشْرَئِبَّيْنِ | مُشْرَئِبَّتَيْنِ | مُشْرَئِبِّينَ | مُشْرَئِبَّاتٍ | مُشْرَئِبٍّ | مُشْرَئِبَّةٍ | مُشْرَئِبَّيْنِ | مُشْرَئِبَّتَيْنِ | مُشْرَئِبِّينَ | مُشْرَئِبَّاتٍ |
      | مرءي | 1 | مُتَمَرْءٍ | مُتَمَرْئِيَةٌ | مُتَمَرْئِيَانِ | مُتَمَرْئِيَتَانِ | مُتَمَرْؤُونَ | مُتَمَرْئِيَاتٌ | مُتَمَرْئِيًا | مُتَمَرْئِيَةً | مُتَمَرْئِيَيْنِ | مُتَمَرْئِيَتَيْنِ | مُتَمَرْئِينَ | مُتَمَرْئِيَاتٍ | مُتَمَرْءٍ | مُتَمَرْئِيَةٍ | مُتَمَرْئِيَيْنِ | مُتَمَرْئِيَتَيْنِ | مُتَمَرْئِينَ | مُتَمَرْئِيَاتٍ |
      | شيطن | 1 | مُتَشَيْطِنٌ | مُتَشَيْطِنَةٌ | مُتَشَيْطِنَانِ | مُتَشَيْطِنَتَانِ | مُتَشَيْطِنُونَ | مُتَشَيْطِنَاتٌ | مُتَشَيْطِنًا | مُتَشَيْطِنَةً | مُتَشَيْطِنَيْنِ | مُتَشَيْطِنَتَيْنِ | مُتَشَيْطِنِينَ | مُتَشَيْطِنَاتٍ | مُتَشَيْطِنٍ | مُتَشَيْطِنَةٍ | مُتَشَيْطِنَيْنِ | مُتَشَيْطِنَتَيْنِ | مُتَشَيْطِنِينَ | مُتَشَيْطِنَاتٍ |
      | وشوش | 1 | مُتَوَشْوِشٌ | مُتَوَشْوِشَةٌ | مُتَوَشْوِشَانِ | مُتَوَشْوِشَتَانِ | مُتَوَشْوِشُونَ | مُتَوَشْوِشَاتٌ | مُتَوَشْوِشًا | مُتَوَشْوِشَةً | مُتَوَشْوِشَيْنِ | مُتَوَشْوِشَتَيْنِ | مُتَوَشْوِشِينَ | مُتَوَشْوِشَاتٍ | مُتَوَشْوِشٍ | مُتَوَشْوِشَةٍ | مُتَوَشْوِشَيْنِ | مُتَوَشْوِشَتَيْنِ | مُتَوَشْوِشِينَ | مُتَوَشْوِشَاتٍ |
      | بخدن | 2 | مُبْخَنْدِنٌ | مُبْخَنْدِنَةٌ | مُبْخَنْدِنَانِ | مُبْخَنْدِنَتَانِ | مُبْخَنْدِنُونَ | مُبْخَنْدِنَاتٌ | مُبْخَنْدِنًا | مُبْخَنْدِنَةً | مُبْخَنْدِنَيْنِ | مُبْخَنْدِنَتَيْنِ | مُبْخَنْدِنِينَ | مُبْخَنْدِنَاتٍ | مُبْخَنْدِنٍ | مُبْخَنْدِنَةٍ | مُبْخَنْدِنَيْنِ | مُبْخَنْدِنَتَيْنِ | مُبْخَنْدِنِينَ | مُبْخَنْدِنَاتٍ |
      | حبطء | 2 | مُحْبَنْطِئٌ | مُحْبَنْطِئَةٌ | مُحْبَنْطِئَانِ | مُحْبَنْطِئَتَانِ | مُحْبَنْطِئُونَ | مُحْبَنْطِئَاتٌ | مُحْبَنْطِئًا | مُحْبَنْطِئَةً | مُحْبَنْطِئَيْنِ | مُحْبَنْطِئَتَيْنِ | مُحْبَنْطِئِينَ | مُحْبَنْطِئَاتٍ | مُحْبَنْطِئٍ | مُحْبَنْطِئَةٍ | مُحْبَنْطِئَيْنِ | مُحْبَنْطِئَتَيْنِ | مُحْبَنْطِئِينَ | مُحْبَنْطِئَاتٍ |
      | حوصل | 2 | مُحْوَنْصِلٌ | مُحْوَنْصِلَةٌ | مُحْوَنْصِلانِ | مُحْوَنْصِلَتَانِ | مُحْوَنْصِلُونَ | مُحْوَنْصِلاتٌ | مُحْوَنْصِلاً | مُحْوَنْصِلَةً | مُحْوَنْصِلَيْنِ | مُحْوَنْصِلَتَيْنِ | مُحْوَنْصِلِينَ | مُحْوَنْصِلاتٍ | مُحْوَنْصِلٍ | مُحْوَنْصِلَةٍ | مُحْوَنْصِلَيْنِ | مُحْوَنْصِلَتَيْنِ | مُحْوَنْصِلِينَ | مُحْوَنْصِلَاتٍ |
      | سلقي | 2 | مُسْلَنْقٍ | مُسْلَنْقِيَةٌ | مُسْلَنْقِيَانِ | مُسْلَنْقِيَتَانِ | مُسْلَنْقُونَ | مُسْلَنْقِيَاتٌ | مُسْلَنْقِيًا | مُسْلَنْقِيَةً | مُسْلَنْقِيَيْنِ | مُسْلَنْقِيَتَيْنِ | مُسْلَنْقِينَ | مُسْلَنْقِيَاتٍ | مُسْلَنْقٍ | مُسْلَنْقِيَةٍ | مُسْلَنْقِيَيْنِ | مُسْلَنْقِيَتَيْنِ | مُسْلَنْقِينَ | مُسْلَنْقِيَاتٍ |
      | فرقع | 1 | مُتَفَرْقِعٌ | مُتَفَرْقِعَةٌ | مُتَفَرْقِعَانِ | مُتَفَرْقِعَتَانِ | مُتَفَرْقِعُونَ | مُتَفَرْقِعَاتٌ | مُتَفَرْقِعًا | مُتَفَرْقِعَةً | مُتَفَرْقِعَيْنِ | مُتَفَرْقِعَتَيْنِ | مُتَفَرْقِعِينَ | مُتَفَرْقِعَاتٍ | مُتَفَرْقِعٍ | مُتَفَرْقِعَةٍ | مُتَفَرْقِعَيْنِ | مُتَفَرْقِعَتَيْنِ | مُتَفَرْقِعِينَ | مُتَفَرْقِعَاتٍ |
      | فرقع | 2 | مُفْرَنْقِعٌ | مُفْرَنْقِعَةٌ | مُفْرَنْقِعَانِ | مُفْرَنْقِعَتَانِ | مُفْرَنْقِعُونَ | مُفْرَنْقِعَاتٌ | مُفْرَنْقِعًا | مُفْرَنْقِعَةً | مُفْرَنْقِعَيْنِ | مُفْرَنْقِعَتَيْنِ | مُفْرَنْقِعِينَ | مُفْرَنْقِعَاتٍ | مُفْرَنْقِعٍ | مُفْرَنْقِعَةٍ | مُفْرَنْقِعَيْنِ | مُفْرَنْقِعَتَيْنِ | مُفْرَنْقِعِينَ | مُفْرَنْقِعَاتٍ |
      | قشعر | 1 | مُتَقَشْعِرٌ | مُتَقَشْعِرَةٌ | مُتَقَشْعِرَانِ | مُتَقَشْعِرَتَانِ | مُتَقَشْعِرُونَ | مُتَقَشْعِرَاتٌ | مُتَقَشْعِرًا | مُتَقَشْعِرَةً | مُتَقَشْعِرَيْنِ | مُتَقَشْعِرَتَيْنِ | مُتَقَشْعِرِينَ | مُتَقَشْعِرَاتٍ | مُتَقَشْعِرٍ | مُتَقَشْعِرَةٍ | مُتَقَشْعِرَيْنِ | مُتَقَشْعِرَتَيْنِ | مُتَقَشْعِرِينَ | مُتَقَشْعِرَاتٍ |
      | قشعر | 3 | مُقْشَعِرٌّ | مُقْشَعِرَّةٌ | مُقْشَعِرَّانِ | مُقْشَعِرَّتَانِ | مُقْشَعِرُّونَ | مُقْشَعِرَّاتٌ | مُقْشَعِرًّا | مُقْشَعِرَّةً | مُقْشَعِرَّيْنِ | مُقْشَعِرَّتَيْنِ | مُقْشَعِرِّينَ | مُقْشَعِرَّاتٍ | مُقْشَعِرٍّ | مُقْشَعِرَّةٍ | مُقْشَعِرَّيْنِ | مُقْشَعِرَّتَيْنِ | مُقْشَعِرِّينَ | مُقْشَعِرَّاتٍ |
      | كوءد | 3 | مُكْوَئِدٌّ | مُكْوَئِدَّةٌ | مُكْوَئِدَّانِ | مُكْوَئِدَّتَانِ | مُكْوَئِدُّونَ | مُكْوَئِدَّاتٌ | مُكْوَئِدًّا | مُكْوَئِدَّةً | مُكْوَئِدَّيْنِ | مُكْوَئِدَّتَيْنِ | مُكْوَئِدِّينَ | مُكْوَئِدَّاتٍ | مُكْوَئِدٍّ | مُكْوَئِدَّةٍ | مُكْوَئِدَّيْنِ | مُكْوَئِدَّتَيْنِ | مُكْوَئِدِّينَ | مُكْوَئِدَّاتٍ |
      | كوهد | 3 | مُكْوَهِدٌّ | مُكْوَهِدَّةٌ | مُكْوَهِدَّانِ | مُكْوَهِدَّتَانِ | مُكْوَهِدُّونَ | مُكْوَهِدَّاتٌ | مُكْوَهِدًّا | مُكْوَهِدَّةً | مُكْوَهِدَّيْنِ | مُكْوَهِدَّتَيْنِ | مُكْوَهِدِّينَ | مُكْوَهِدَّاتٍ | مُكْوَهِدٍّ | مُكْوَهِدَّةٍ | مُكْوَهِدَّيْنِ | مُكْوَهِدَّتَيْنِ | مُكْوَهِدِّينَ | مُكْوَهِدَّاتٍ |
      | مضحن | 3 | مُمْضَحِنٌّ | مُمْضَحِنَّةٌ | مُمْضَحِنَّانِ | مُمْضَحِنَّتَانِ | مُمْضَحِنُّونَ | مُمْضَحِنَّاتٌ | مُمْضَحِنًّا | مُمْضَحِنَّةً | مُمْضَحِنَّيْنِ | مُمْضَحِنَّتَيْنِ | مُمْضَحِنِّينَ | مُمْضَحِنَّاتٍ | مُمْضَحِنٍّ | مُمْضَحِنَّةٍ | مُمْضَحِنَّيْنِ | مُمْضَحِنَّتَيْنِ | مُمْضَحِنِّينَ | مُمْضَحِنَّاتٍ |
