###
# /*
# *
# * MIT License
# *
# * Copyright (c) 2021 Abdalaziz Alsaydi
# *
# * Permission is hereby granted, free of charge, to any person obtaining a copy
# * of this software and associated documentation files (the "Software"), to deal
# * in the Software without restriction, including without limitation the rights
# * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
# * copies of the Software, and to permit persons to whom the Software is
# * furnished to do so, subject to the following conditions:
# *
# * The above copyright notice and this permission notice shall be included in all
# * copies or substantial portions of the Software.
# *
# * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
# * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
# * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
# * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
# * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
# * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
# * SOFTWARE.
# */

Feature: تصريف اسم الصفة المشبهة من الفعل الثلاثي المجرد

  Scenario Outline: unaugmented trilateral assimilate adjectives
    Given an unaugmented verb
    When the derived noun is "Assimilate" and the root type is "TrilateralUnaugmented"
    Then singular masculine nouns of the verb "<verb>" in conjugation "<conjugation>" are nominative "<m_single_n>" and accusative "<m_single_a>" and genitive "<m_single_g>" with formula "<formula>"
    And  singular feminine nouns of the verb "<verb>" in conjugation "<conjugation>" are nominative "<f_single_n>" and accusative "<f_single_a>" and genitive "<f_single_g>" with formula "<formula>"
    And  dual masculine nouns of the verb "<verb>" in conjugation "<conjugation>" are nominative "<m_dual_n>" and accusative "<m_dual_a>" and genitive "<m_dual_g>" with formula "<formula>"
    And  dual feminine nouns of the verb "<verb>" in conjugation "<conjugation>" are nominative "<f_dual_n>" and accusative "<f_dual_a>" and genitive "<f_dual_g>" with formula "<formula>"
    And  plural masculine nouns of the verb "<verb>" in conjugation "<conjugation>" are nominative "<m_plural_n>" and accusative "<m_plural_a>" and genitive "<m_plural_g>" with formula "<formula>"
    And  plural feminine nouns of the verb "<verb>" in conjugation "<conjugation>" are nominative "<f_plural_n>" and accusative "<f_plural_a>" and genitive "<f_plural_g>" with formula "<formula>"
    Examples:
      | verb | conjugation | m_single_n | f_single_n | m_dual_n     | f_dual_n      | m_plural_n | f_plural_n  | m_single_a | f_single_a | m_dual_a      | f_dual_a       | m_plural_a | f_plural_a  | m_single_g | f_single_g | m_dual_g      | f_dual_g       | m_plural_g | f_plural_g  | formula   |
      | تلد | 4 | تَلِيدٌ | تَلِيدَةٌ | تَلِيدَانِ | تَلِيدَتَانِ | تَلِيدُونَ | تَلِيدَاتٌ | تَلِيدًا | تَلِيدَةً | تَلِيدَيْنِ | تَلِيدَتَيْنِ | تَلِيدِينَ | تَلِيدَاتٍ | تَلِيدٍ | تَلِيدَةٍ | تَلِيدَيْنِ | تَلِيدَتَيْنِ | تَلِيدِينَ | تَلِيدَاتٍ |فَعِيل |
      | جوع | 1 | جَوْعَانُ | جَوْعَانَةٌ | جَوْعَانَانِ | جَوْعَانَتَانِ |  |  | جَوْعَانَ | جَوْعَانَةً | جَوْعَانَيْنِ | جَوْعَانَتَيْنِ |  |  | جَوْعَانَ | جَوْعَانَةٍ | جَوْعَانَيْنِ | جَوْعَانَتَيْنِ |  |  |فَعْلان / فَعْلانة |
      | جوع | 1 | جَوْعَانُ | جَوْعَى | جَوْعَانَانِ | جَوْعَيَانِ |  |  | جَوْعَانَ | جَوْعَى | جَوْعَانَيْنِ | جَوْعَيَيْنِ |  |  | جَوْعَانَ | جَوْعَى | جَوْعَانَيْنِ | جَوْعَيَيْنِ |  |  |فَعْلان / فَعْلَى |
      | جدب | 5 | جَدِيبٌ | جَدِيبَةٌ | جَدِيبَانِ | جَدِيبَتَانِ | جَدِيبُونَ | جَدِيبَاتٌ | جَدِيبًا | جَدِيبَةً | جَدِيبَيْنِ | جَدِيبَتَيْنِ | جَدِيبِينَ | جَدِيبَاتٍ | جَدِيبٍ | جَدِيبَةٍ | جَدِيبَيْنِ | جَدِيبَتَيْنِ | جَدِيبِينَ | جَدِيبَاتٍ |فَعِيل |
      | جدب | 5 | جَدْبٌ | جَدْبَةٌ | جَدْبَانِ | جَدْبَتَانِ | جَدْبُونَ | جَدْبَاتٌ | جَدْبًا | جَدْبَةً | جَدْبَيْنِ | جَدْبَتَيْنِ | جَدْبِينَ | جَدْبَاتٍ | جَدْبٍ | جَدْبَةٍ | جَدْبَيْنِ | جَدْبَتَيْنِ | جَدْبِينَ | جَدْبَاتٍ |فَعْل |
      | جرب | 4 | جَرِبٌ | جَرِبَةٌ | جَرِبَانِ | جَرِبَتَانِ | جَرِبُونَ | جَرِبَاتٌ | جَرِبًا | جَرِبَةً | جَرِبَيْنِ | جَرِبَتَيْنِ | جَرِبِينَ | جَرِبَاتٍ | جَرِبٍ | جَرِبَةٍ | جَرِبَيْنِ | جَرِبَتَيْنِ | جَرِبِينَ | جَرِبَاتٍ |فَعِل |
      | جرب | 4 | أَجْرَبُ | جَرْبَاءُ | أَجْرَبَانِ | جَرْبَاوَانِ | جُرْبٌ | جُرْبٌ | أَجْرَبَ | جَرْبَاءَ | أَجْرَبَيْنِ | جَرْبَاوَيْنِ | جُرْبًا | جُرْبًا | أَجْرَبَ | جَرْبَاءَ | أَجْرَبَيْنِ | جَرْبَاوَيْنِ | جُرْبٍ | جُرْبٍ |أَفْعَل |
      | جرب | 4 | جَرْبَانُ | جَرْبَانَةٌ | جَرْبَانَانِ | جَرْبَانَتَانِ |  |  | جَرْبَانَ | جَرْبَانَةً | جَرْبَانَيْنِ | جَرْبَانَتَيْنِ |  |  | جَرْبَانَ | جَرْبَانَةٍ | جَرْبَانَيْنِ | جَرْبَانَتَيْنِ |  |  |فَعْلان / فَعْلانة |
      | جرب | 4 | جَرْبَانُ | جَرْبَى | جَرْبَانَانِ | جَرْبَيَانِ |  |  | جَرْبَانَ | جَرْبَى | جَرْبَانَيْنِ | جَرْبَيَيْنِ |  |  | جَرْبَانَ | جَرْبَى | جَرْبَانَيْنِ | جَرْبَيَيْنِ |  |  |فَعْلان / فَعْلَى |
      | جرد | 4 | جَرِدٌ | جَرِدَةٌ | جَرِدَانِ | جَرِدَتَانِ | جَرِدُونَ | جَرِدَاتٌ | جَرِدًا | جَرِدَةً | جَرِدَيْنِ | جَرِدَتَيْنِ | جَرِدِينَ | جَرِدَاتٍ | جَرِدٍ | جَرِدَةٍ | جَرِدَيْنِ | جَرِدَتَيْنِ | جَرِدِينَ | جَرِدَاتٍ |فَعِل |
      | جرد | 4 | أَجْرَدُ | جَرْدَاءُ | أَجْرَدَانِ | جَرْدَاوَانِ | جُرْدٌ | جُرْدٌ | أَجْرَدَ | جَرْدَاءَ | أَجْرَدَيْنِ | جَرْدَاوَيْنِ | جُرْدًا | جُرْدًا | أَجْرَدَ | جَرْدَاءَ | أَجْرَدَيْنِ | جَرْدَاوَيْنِ | جُرْدٍ | جُرْدٍ |أَفْعَل |
      | جهم | 5 | جَهِيمٌ | جَهِيمَةٌ | جَهِيمَانِ | جَهِيمَتَانِ | جَهِيمُونَ | جَهِيمَاتٌ | جَهِيمًا | جَهِيمَةً | جَهِيمَيْنِ | جَهِيمَتَيْنِ | جَهِيمِينَ | جَهِيمَاتٍ | جَهِيمٍ | جَهِيمَةٍ | جَهِيمَيْنِ | جَهِيمَتَيْنِ | جَهِيمِينَ | جَهِيمَاتٍ |فَعِيل |
      | جهم | 5 | جَهْمٌ | جَهْمَةٌ | جَهْمَانِ | جَهْمَتَانِ | جَهْمُونَ | جَهْمَاتٌ | جَهْمًا | جَهْمَةً | جَهْمَيْنِ | جَهْمَتَيْنِ | جَهْمِينَ | جَهْمَاتٍ | جَهْمٍ | جَهْمَةٍ | جَهْمَيْنِ | جَهْمَتَيْنِ | جَهْمِينَ | جَهْمَاتٍ |فَعْل |
      | حزن | 4 | حَزِينٌ | حَزِينَةٌ | حَزِينَانِ | حَزِينَتَانِ | حَزِينُونَ | حَزِينَاتٌ | حَزِينًا | حَزِينَةً | حَزِينَيْنِ | حَزِينَتَيْنِ | حَزِينِينَ | حَزِينَاتٍ | حَزِينٍ | حَزِينَةٍ | حَزِينَيْنِ | حَزِينَتَيْنِ | حَزِينِينَ | حَزِينَاتٍ |فَعِيل |
      | حزن | 4 | حَزِنٌ | حَزِنَةٌ | حَزِنَانِ | حَزِنَتَانِ | حَزِنُونَ | حَزِنَاتٌ | حَزِنًا | حَزِنَةً | حَزِنَيْنِ | حَزِنَتَيْنِ | حَزِنِينَ | حَزِنَاتٍ | حَزِنٍ | حَزِنَةٍ | حَزِنَيْنِ | حَزِنَتَيْنِ | حَزِنِينَ | حَزِنَاتٍ |فَعِل |
      | حزن | 4 | حَزْنَانُ | حَزْنَانَةٌ | حَزْنَانَانِ | حَزْنَانَتَانِ |  |  | حَزْنَانَ | حَزْنَانَةً | حَزْنَانَيْنِ | حَزْنَانَتَيْنِ |  |  | حَزْنَانَ | حَزْنَانَةٍ | حَزْنَانَيْنِ | حَزْنَانَتَيْنِ |  |  |فَعْلان / فَعْلانة |
      | حزن | 4 | حَزْنَانُ | حَزْنَى | حَزْنَانَانِ | حَزْنَيَانِ |  |  | حَزْنَانَ | حَزْنَى | حَزْنَانَيْنِ | حَزْنَيَيْنِ |  |  | حَزْنَانَ | حَزْنَى | حَزْنَانَيْنِ | حَزْنَيَيْنِ |  |  |فَعْلان / فَعْلَى |
      | حزن | 5 | حَزْنٌ | حَزْنَةٌ | حَزْنَانِ | حَزْنَتَانِ | حَزْنُونَ | حَزْنَاتٌ | حَزْنًا | حَزْنَةً | حَزْنَيْنِ | حَزْنَتَيْنِ | حَزْنِينَ | حَزْنَاتٍ | حَزْنٍ | حَزْنَةٍ | حَزْنَيْنِ | حَزْنَتَيْنِ | حَزْنِينَ | حَزْنَاتٍ |فَعْل |
      | خشن | 5 | خَشِنٌ | خَشِنَةٌ | خَشِنَانِ | خَشِنَتَانِ | خَشِنُونَ | خَشِنَاتٌ | خَشِنًا | خَشِنَةً | خَشِنَيْنِ | خَشِنَتَيْنِ | خَشِنِينَ | خَشِنَاتٍ | خَشِنٍ | خَشِنَةٍ | خَشِنَيْنِ | خَشِنَتَيْنِ | خَشِنِينَ | خَشِنَاتٍ |فَعِل |
      | خشن | 5 | أَخْشَنُ | خَشْنَاءُ | أَخْشَنَانِ | خَشْنَاوَانِ | خُشْنٌ | خُشْنٌ | أَخْشَنَ | خَشْنَاءَ | أَخْشَنَيْنِ | خَشْنَاوَيْنِ | خُشْنًا | خُشْنًا | أَخْشَنَ | خَشْنَاءَ | أَخْشَنَيْنِ | خَشْنَاوَيْنِ | خُشْنٍ | خُشْنٍ |أَفْعَل |
      | رطب | 4 | رَطْبٌ | رَطْبَةٌ | رَطْبَانِ | رَطْبَتَانِ | رَطْبُونَ | رَطْبَاتٌ | رَطْبًا | رَطْبَةً | رَطْبَيْنِ | رَطْبَتَيْنِ | رَطْبِينَ | رَطْبَاتٍ | رَطْبٍ | رَطْبَةٍ | رَطْبَيْنِ | رَطْبَتَيْنِ | رَطْبِينَ | رَطْبَاتٍ |فَعْل |
      | رطب | 5 | رَطِيبٌ | رَطِيبَةٌ | رَطِيبَانِ | رَطِيبَتَانِ | رَطِيبُونَ | رَطِيبَاتٌ | رَطِيبًا | رَطِيبَةً | رَطِيبَيْنِ | رَطِيبَتَيْنِ | رَطِيبِينَ | رَطِيبَاتٍ | رَطِيبٍ | رَطِيبَةٍ | رَطِيبَيْنِ | رَطِيبَتَيْنِ | رَطِيبِينَ | رَطِيبَاتٍ |فَعِيل |
      | رطب | 5 | رَطْبٌ | رَطْبَةٌ | رَطْبَانِ | رَطْبَتَانِ | رَطْبُونَ | رَطْبَاتٌ | رَطْبًا | رَطْبَةً | رَطْبَيْنِ | رَطْبَتَيْنِ | رَطْبِينَ | رَطْبَاتٍ | رَطْبٍ | رَطْبَةٍ | رَطْبَيْنِ | رَطْبَتَيْنِ | رَطْبِينَ | رَطْبَاتٍ |فَعْل |
      | رغد | 5 | رَغِيدٌ | رَغِيدَةٌ | رَغِيدَانِ | رَغِيدَتَانِ | رَغِيدُونَ | رَغِيدَاتٌ | رَغِيدًا | رَغِيدَةً | رَغِيدَيْنِ | رَغِيدَتَيْنِ | رَغِيدِينَ | رَغِيدَاتٍ | رَغِيدٍ | رَغِيدَةٍ | رَغِيدَيْنِ | رَغِيدَتَيْنِ | رَغِيدِينَ | رَغِيدَاتٍ |فَعِيل |
      | رغد | 5 | رَغْدٌ | رَغْدَةٌ | رَغْدَانِ | رَغْدَتَانِ | رَغْدُونَ | رَغْدَاتٌ | رَغْدًا | رَغْدَةً | رَغْدَيْنِ | رَغْدَتَيْنِ | رَغْدِينَ | رَغْدَاتٍ | رَغْدٍ | رَغْدَةٍ | رَغْدَيْنِ | رَغْدَتَيْنِ | رَغْدِينَ | رَغْدَاتٍ |فَعْل |
      | سمج | 5 | سَمِيجٌ | سَمِيجَةٌ | سَمِيجَانِ | سَمِيجَتَانِ | سَمِيجُونَ | سَمِيجَاتٌ | سَمِيجًا | سَمِيجَةً | سَمِيجَيْنِ | سَمِيجَتَيْنِ | سَمِيجِينَ | سَمِيجَاتٍ | سَمِيجٍ | سَمِيجَةٍ | سَمِيجَيْنِ | سَمِيجَتَيْنِ | سَمِيجِينَ | سَمِيجَاتٍ |فَعِيل |
      | سمج | 5 | سَمِجٌ | سَمِجَةٌ | سَمِجَانِ | سَمِجَتَانِ | سَمِجُونَ | سَمِجَاتٌ | سَمِجًا | سَمِجَةً | سَمِجَيْنِ | سَمِجَتَيْنِ | سَمِجِينَ | سَمِجَاتٍ | سَمِجٍ | سَمِجَةٍ | سَمِجَيْنِ | سَمِجَتَيْنِ | سَمِجِينَ | سَمِجَاتٍ |فَعِل |
      | سمج | 5 | سَمْجٌ | سَمْجَةٌ | سَمْجَانِ | سَمْجَتَانِ | سَمْجُونَ | سَمْجَاتٌ | سَمْجًا | سَمْجَةً | سَمْجَيْنِ | سَمْجَتَيْنِ | سَمْجِينَ | سَمْجَاتٍ | سَمْجٍ | سَمْجَةٍ | سَمْجَيْنِ | سَمْجَتَيْنِ | سَمْجِينَ | سَمْجَاتٍ |فَعْل |
      | طول | 1 | طَوِيلٌ | طَوِيلَةٌ | طَوِيلانِ | طَوِيلَتَانِ | طَوِيلُونَ | طَوِيلاتٌ | طَوِيلاً | طَوِيلَةً | طَوِيلَيْنِ | طَوِيلَتَيْنِ | طَوِيلِينَ | طَوِيلاتٍ | طَوِيلٍ | طَوِيلَةٍ | طَوِيلَيْنِ | طَوِيلَتَيْنِ | طَوِيلِينَ | طَوِيلَاتٍ |فَعِيل |
      | عفف | 2 | عَفِيفٌ | عَفِيفَةٌ | عَفِيفَانِ | عَفِيفَتَانِ | عَفِيفُونَ | عَفِيفَاتٌ | عَفِيفًا | عَفِيفَةً | عَفِيفَيْنِ | عَفِيفَتَيْنِ | عَفِيفِينَ | عَفِيفَاتٍ | عَفِيفٍ | عَفِيفَةٍ | عَفِيفَيْنِ | عَفِيفَتَيْنِ | عَفِيفِينَ | عَفِيفَاتٍ |فَعِيل |
      | عفف | 2 | عَفٌّ | عَفَّةٌ | عَفَّانِ | عَفَّتَانِ | عَفُّونَ | عَفَّاتٌ | عَفًّا | عَفَّةً | عَفَّيْنِ | عَفَّتَيْنِ | عَفِّينَ | عَفَّاتٍ | عَفٍّ | عَفَّةٍ | عَفَّيْنِ | عَفَّتَيْنِ | عَفِّينَ | عَفَّاتٍ |فَعْل |
      | غضب | 4 | غَضِبٌ | غَضِبَةٌ | غَضِبَانِ | غَضِبَتَانِ | غَضِبُونَ | غَضِبَاتٌ | غَضِبًا | غَضِبَةً | غَضِبَيْنِ | غَضِبَتَيْنِ | غَضِبِينَ | غَضِبَاتٍ | غَضِبٍ | غَضِبَةٍ | غَضِبَيْنِ | غَضِبَتَيْنِ | غَضِبِينَ | غَضِبَاتٍ |فَعِل |
      | غضب | 4 | غَضْبَانُ | غَضْبَانَةٌ | غَضْبَانَانِ | غَضْبَانَتَانِ |  |  | غَضْبَانَ | غَضْبَانَةً | غَضْبَانَيْنِ | غَضْبَانَتَيْنِ |  |  | غَضْبَانَ | غَضْبَانَةٍ | غَضْبَانَيْنِ | غَضْبَانَتَيْنِ |  |  |فَعْلان / فَعْلانة |
      | غضب | 4 | غَضْبَانُ | غَضْبَى | غَضْبَانَانِ | غَضْبَيَانِ |  |  | غَضْبَانَ | غَضْبَى | غَضْبَانَيْنِ | غَضْبَيَيْنِ |  |  | غَضْبَانَ | غَضْبَى | غَضْبَانَيْنِ | غَضْبَيَيْنِ |  |  |فَعْلان / فَعْلَى |
      | قلل | 2 | قَلِيلٌ | قَلِيلَةٌ | قَلِيلانِ | قَلِيلَتَانِ | قَلِيلُونَ | قَلِيلاتٌ | قَلِيلاً | قَلِيلَةً | قَلِيلَيْنِ | قَلِيلَتَيْنِ | قَلِيلِينَ | قَلِيلاتٍ | قَلِيلٍ | قَلِيلَةٍ | قَلِيلَيْنِ | قَلِيلَتَيْنِ | قَلِيلِينَ | قَلِيلَاتٍ |فَعِيل |
      | كسل | 4 | كَسِلٌ | كَسِلَةٌ | كَسِلانِ | كَسِلَتَانِ | كَسِلُونَ | كَسِلاتٌ | كَسِلاً | كَسِلَةً | كَسِلَيْنِ | كَسِلَتَيْنِ | كَسِلِينَ | كَسِلاتٍ | كَسِلٍ | كَسِلَةٍ | كَسِلَيْنِ | كَسِلَتَيْنِ | كَسِلِينَ | كَسِلَاتٍ |فَعِل |
      | كسل | 4 | كَسْلانُ | كَسْلانَةٌ | كَسْلانَانِ | كَسْلانَتَانِ |  |  | كَسْلانَ | كَسْلانَةً | كَسْلانَيْنِ | كَسْلانَتَيْنِ |  |  | كَسْلانَ | كَسْلَانَةٍ | كَسْلَانَيْنِ | كَسْلَانَتَيْنِ |  |  |فَعْلان / فَعْلانة |
      | كسل | 4 | كَسْلانُ | كَسْلَى | كَسْلانَانِ | كَسْلَيَانِ |  |  | كَسْلانَ | كَسْلَى | كَسْلانَيْنِ | كَسْلَيَيْنِ |  |  | كَسْلانَ | كَسْلَى | كَسْلَانَيْنِ | كَسْلَيَيْنِ |  |  |فَعْلان / فَعْلَى |
      | كلل | 2 | كَلٌّ | كَلَّةٌ | كَلاَّنِ | كَلَّتَانِ | كَلُّونَ | كَلاَّتٌ | كَلًّا | كَلَّةً | كَلَّيْنِ | كَلَّتَيْنِ | كَلِّينَ | كَلاَّتٍ | كَلٍّ | كَلَّةٍ | كَلَّيْنِ | كَلَّتَيْنِ | كَلِّينَ | كَلَّاتٍ |فَعْل |
      | نزه | 4 | نَزِيهٌ | نَزِيهَةٌ | نَزِيهَانِ | نَزِيهَتَانِ | نَزِيهُونَ | نَزِيهَاتٌ | نَزِيهًا | نَزِيهَةً | نَزِيهَيْنِ | نَزِيهَتَيْنِ | نَزِيهِينَ | نَزِيهَاتٍ | نَزِيهٍ | نَزِيهَةٍ | نَزِيهَيْنِ | نَزِيهَتَيْنِ | نَزِيهِينَ | نَزِيهَاتٍ |فَعِيل |
      | نزه | 4 | نَزِهٌ | نَزِهَةٌ | نَزِهَانِ | نَزِهَتَانِ | نَزِهُونَ | نَزِهَاتٌ | نَزِهًا | نَزِهَةً | نَزِهَيْنِ | نَزِهَتَيْنِ | نَزِهِينَ | نَزِهَاتٍ | نَزِهٍ | نَزِهَةٍ | نَزِهَيْنِ | نَزِهَتَيْنِ | نَزِهِينَ | نَزِهَاتٍ |فَعِل |
      | نزه | 5 | نَزِيهٌ | نَزِيهَةٌ | نَزِيهَانِ | نَزِيهَتَانِ | نَزِيهُونَ | نَزِيهَاتٌ | نَزِيهًا | نَزِيهَةً | نَزِيهَيْنِ | نَزِيهَتَيْنِ | نَزِيهِينَ | نَزِيهَاتٍ | نَزِيهٍ | نَزِيهَةٍ | نَزِيهَيْنِ | نَزِيهَتَيْنِ | نَزِيهِينَ | نَزِيهَاتٍ |فَعِيل |
      | نزه | 5 | نَزِهٌ | نَزِهَةٌ | نَزِهَانِ | نَزِهَتَانِ | نَزِهُونَ | نَزِهَاتٌ | نَزِهًا | نَزِهَةً | نَزِهَيْنِ | نَزِهَتَيْنِ | نَزِهِينَ | نَزِهَاتٍ | نَزِهٍ | نَزِهَةٍ | نَزِهَيْنِ | نَزِهَتَيْنِ | نَزِهِينَ | نَزِهَاتٍ |فَعِل |
      | نعس | 3 | نَعْسَانُ | نَعْسَانَةٌ | نَعْسَانَانِ | نَعْسَانَتَانِ |  |  | نَعْسَانَ | نَعْسَانَةً | نَعْسَانَيْنِ | نَعْسَانَتَيْنِ |  |  | نَعْسَانَ | نَعْسَانَةٍ | نَعْسَانَيْنِ | نَعْسَانَتَيْنِ |  |  |فَعْلان / فَعْلانة |
      | نعس | 3 | نَعْسَانُ | نَعْسَى | نَعْسَانَانِ | نَعْسَيَانِ |  |  | نَعْسَانَ | نَعْسَى | نَعْسَانَيْنِ | نَعْسَيَيْنِ |  |  | نَعْسَانَ | نَعْسَى | نَعْسَانَيْنِ | نَعْسَيَيْنِ |  |  |فَعْلان / فَعْلَى |
      | هيم | 2 | هَيْمَانُ | هَيْمَانَةٌ | هَيْمَانَانِ | هَيْمَانَتَانِ |  |  | هَيْمَانَ | هَيْمَانَةً | هَيْمَانَيْنِ | هَيْمَانَتَيْنِ |  |  | هَيْمَانَ | هَيْمَانَةٍ | هَيْمَانَيْنِ | هَيْمَانَتَيْنِ |  |  |فَعْلان / فَعْلانة |
      | هيم | 2 | هَيْمَانُ | هَيْمَى | هَيْمَانَانِ | هَيْمَيَانِ |  |  | هَيْمَانَ | هَيْمَى | هَيْمَانَيْنِ | هَيْمَيَيْنِ |  |  | هَيْمَانَ | هَيْمَى | هَيْمَانَيْنِ | هَيْمَيَيْنِ |  |  |فَعْلان / فَعْلَى |
      | وله | 4 | وَلْهَانُ | وَلْهَانَةٌ | وَلْهَانَانِ | وَلْهَانَتَانِ |  |  | وَلْهَانَ | وَلْهَانَةً | وَلْهَانَيْنِ | وَلْهَانَتَيْنِ |  |  | وَلْهَانَ | وَلْهَانَةٍ | وَلْهَانَيْنِ | وَلْهَانَتَيْنِ |  |  |فَعْلان / فَعْلانة |
      | وله | 4 | وَلْهَانُ | وَلْهَى | وَلْهَانَانِ | وَلْهَيَانِ |  |  | وَلْهَانَ | وَلْهَى | وَلْهَانَيْنِ | وَلْهَيَيْنِ |  |  | وَلْهَانَ | وَلْهَى | وَلْهَانَيْنِ | وَلْهَيَيْنِ |  |  |فَعْلان / فَعْلَى |
      | وله | 6 | وَلْهَانُ | وَلْهَانَةٌ | وَلْهَانَانِ | وَلْهَانَتَانِ |  |  | وَلْهَانَ | وَلْهَانَةً | وَلْهَانَيْنِ | وَلْهَانَتَيْنِ |  |  | وَلْهَانَ | وَلْهَانَةٍ | وَلْهَانَيْنِ | وَلْهَانَتَيْنِ |  |  |فَعْلان / فَعْلانة |
      | وله | 6 | وَلْهَانُ | وَلْهَى | وَلْهَانَانِ | وَلْهَيَانِ |  |  | وَلْهَانَ | وَلْهَى | وَلْهَانَيْنِ | وَلْهَيَيْنِ |  |  | وَلْهَانَ | وَلْهَى | وَلْهَانَيْنِ | وَلْهَيَيْنِ |  |  |فَعْلان / فَعْلَى |
      | يبس | 4 | يَبِيسٌ | يَبِيسَةٌ | يَبِيسَانِ | يَبِيسَتَانِ | يَبِيسُونَ | يَبِيسَاتٌ | يَبِيسًا | يَبِيسَةً | يَبِيسَيْنِ | يَبِيسَتَيْنِ | يَبِيسِينَ | يَبِيسَاتٍ | يَبِيسٍ | يَبِيسَةٍ | يَبِيسَيْنِ | يَبِيسَتَيْنِ | يَبِيسِينَ | يَبِيسَاتٍ |فَعِيل |
      | يبس | 4 | يَبِسٌ | يَبِسَةٌ | يَبِسَانِ | يَبِسَتَانِ | يَبِسُونَ | يَبِسَاتٌ | يَبِسًا | يَبِسَةً | يَبِسَيْنِ | يَبِسَتَيْنِ | يَبِسِينَ | يَبِسَاتٍ | يَبِسٍ | يَبِسَةٍ | يَبِسَيْنِ | يَبِسَتَيْنِ | يَبِسِينَ | يَبِسَاتٍ |فَعِل |
      | يبس | 4 | يَبْسٌ | يَبْسَةٌ | يَبْسَانِ | يَبْسَتَانِ | يَبْسُونَ | يَبْسَاتٌ | يَبْسًا | يَبْسَةً | يَبْسَيْنِ | يَبْسَتَيْنِ | يَبْسِينَ | يَبْسَاتٍ | يَبْسٍ | يَبْسَةٍ | يَبْسَيْنِ | يَبْسَتَيْنِ | يَبْسِينَ | يَبْسَاتٍ |فَعْل |
      | يبس | 6 | يَبِيسٌ | يَبِيسَةٌ | يَبِيسَانِ | يَبِيسَتَانِ | يَبِيسُونَ | يَبِيسَاتٌ | يَبِيسًا | يَبِيسَةً | يَبِيسَيْنِ | يَبِيسَتَيْنِ | يَبِيسِينَ | يَبِيسَاتٍ | يَبِيسٍ | يَبِيسَةٍ | يَبِيسَيْنِ | يَبِيسَتَيْنِ | يَبِيسِينَ | يَبِيسَاتٍ |فَعِيل |
      | يبس | 6 | يَبِسٌ | يَبِسَةٌ | يَبِسَانِ | يَبِسَتَانِ | يَبِسُونَ | يَبِسَاتٌ | يَبِسًا | يَبِسَةً | يَبِسَيْنِ | يَبِسَتَيْنِ | يَبِسِينَ | يَبِسَاتٍ | يَبِسٍ | يَبِسَةٍ | يَبِسَيْنِ | يَبِسَتَيْنِ | يَبِسِينَ | يَبِسَاتٍ |فَعِل |
      | يبس | 6 | يَبْسٌ | يَبْسَةٌ | يَبْسَانِ | يَبْسَتَانِ | يَبْسُونَ | يَبْسَاتٌ | يَبْسًا | يَبْسَةً | يَبْسَيْنِ | يَبْسَتَيْنِ | يَبْسِينَ | يَبْسَاتٍ | يَبْسٍ | يَبْسَةٍ | يَبْسَيْنِ | يَبْسَتَيْنِ | يَبْسِينَ | يَبْسَاتٍ |فَعْل |
      | مرن | 1 | مَرِنٌ | مَرِنَةٌ | مَرِنَانِ | مَرِنَتَانِ | مَرِنُونَ | مَرِنَاتٌ | مَرِنًا | مَرِنَةً | مَرِنَيْنِ | مَرِنَتَيْنِ | مَرِنِينَ | مَرِنَاتٍ | مَرِنٍ | مَرِنَةٍ | مَرِنَيْنِ | مَرِنَتَيْنِ | مَرِنِينَ | مَرِنَاتٍ |فَعِل |
      | ءبي | 4 | أبِيٌّ | أبِيَّةٌ | أبِيَّانِ | أبِيَّتَانِ | أبِيُّونَ | أبِيَّاتٌ | أبِيًّا | أبِيَّةً | أبِيَّيْنِ | أبِيَّتَيْنِ | أبِيِّينَ | أبِيَّاتٍ | أبِيٍّ | أبِيَّةٍ | أبِيَّيْنِ | أبِيَّتَيْنِ | أبِيِّينَ | أبِيَّاتٍ |فَعِيل |
      | ءذي | 4 | أذِيٌّ | أذِيَّةٌ | أذِيَّانِ | أذِيَّتَانِ | أذِيُّونَ | أذِيَّاتٌ | أذِيًّا | أذِيَّةً | أذِيَّيْنِ | أذِيَّتَيْنِ | أذِيِّينَ | أذِيَّاتٍ | أذِيٍّ | أذِيَّةٍ | أذِيَّيْنِ | أذِيَّتَيْنِ | أذِيِّينَ | أذِيَّاتٍ |فَعِيل |
      | ءذي | 4 | أذٍ | أذِيَةٌ | أذِيَانِ | أذِيَتَانِ | أذُونَ | أذِيَاتٌ | أذِيًا | أذِيَةً | أذِيَيْنِ | أذِيَتَيْنِ | أذِينَ | أذِيَاتٍ | أذٍ | أذِيَةٍ | أذِيَيْنِ | أذِيَتَيْنِ | أذِينَ | أذِيَاتٍ |فَعِل |
      | ءمن | 5 | أمِينٌ | أمِينَةٌ | أمِينَانِ | أمِينَتَانِ | أمِينُونَ | أمِينَاتٌ | أمِينًا | أمِينَةً | أمِينَيْنِ | أمِينَتَيْنِ | أمِينِينَ | أمِينَاتٍ | أمِينٍ | أمِينَةٍ | أمِينَيْنِ | أمِينَتَيْنِ | أمِينِينَ | أمِينَاتٍ |فَعِيل |
      | ءمر | 4 | أمِرٌ | أمِرَةٌ | أمِرَانِ | أمِرَتَانِ | أمِرُونَ | أمِرَاتٌ | أمِرًا | أمِرَةً | أمِرَيْنِ | أمِرَتَيْنِ | أمِرِينَ | أمِرَاتٍ | أمِرٍ | أمِرَةٍ | أمِرَيْنِ | أمِرَتَيْنِ | أمِرِينَ | أمِرَاتٍ |فَعِل |
      | ءود | 4 | آْوَدُ | أوْدَاءُ | آْوَدَانِ | أوْدَاوَانِ | ءُوْدٌ | ءُوْدٌ | آْوَدَ | أوْدَاأ | آْوَدَيْنِ | أوْدَاوَيْنِ | ءُوْدًا | ءُوْدًا | آْوَدَ | أوْدَاأ | آْوَدَيْنِ | أوْدَاوَيْنِ | ءُوْدٍ | ءُوْدٍ |أَفْعَل |
      | بحح | 4 | أَبَحُّ | بَحَّاءُ | أَبَحَّانِ | بَحَّاوَانِ | بُحْحٌ | بُحْحٌ | أَبَحَّ | بَحَّاءَ | أَبَحَّيْنِ | بَحَّاوَيْنِ | بُحْحًا | بُحْحًا | أَبَحَّ | بَحَّاءَ | أَبَحَّيْنِ | بَحَّاوَيْنِ | بُحْحٍ | بُحْحٍ |أَفْعَل |
      | جرء | 5 | جَرِيءٌ | جَرِيئَةٌ | جَرِيئَانِ | جَرِيئَتَانِ | جَرِيئُونَ | جَرِيئَاتٌ | جَرِيئًا | جَرِيئَةً | جَرِيئَيْنِ | جَرِيئَتَيْنِ | جَرِيئِينَ | جَرِيئَاتٍ | جَرِيءٍ | جَرِيئَةٍ | جَرِيئَيْنِ | جَرِيئَتَيْنِ | جَرِيئِينَ | جَرِيئَاتٍ |فَعِيل |
      | حور | 4 | أَحْوَرُ | حَوْرَاءُ | أَحْوَرَانِ | حَوْرَاوَانِ | حُوْرٌ | حُوْرٌ | أَحْوَرَ | حَوْرَاءَ | أَحْوَرَيْنِ | حَوْرَاوَيْنِ | حُوْرًا | حُوْرًا | أَحْوَرَ | حَوْرَاءَ | أَحْوَرَيْنِ | حَوْرَاوَيْنِ | حُوْرٍ | حُوْرٍ |أَفْعَل |
      | سوو | 4 | سَوِيٌّ | سَوِيَّةٌ | سَوِيَّانِ | سَوِيَّتَانِ | سَوِيُّونَ | سَوِيَّاتٌ | سَوِيًّا | سَوِيَّةً | سَوِيَّيْنِ | سَوِيَّتَيْنِ | سَوِيِّينَ | سَوِيَّاتٍ | سَوِيٍّ | سَوِيَّةٍ | سَوِيَّيْنِ | سَوِيَّتَيْنِ | سَوِيِّينَ | سَوِيَّاتٍ |فَعِيل |
      | ضءل | 5 | ضَئِيلٌ | ضَئِيلَةٌ | ضَئِيلانِ | ضَئِيلَتَانِ | ضَئِيلُونَ | ضَئِيلاتٌ | ضَئِيلاً | ضَئِيلَةً | ضَئِيلَيْنِ | ضَئِيلَتَيْنِ | ضَئِيلِينَ | ضَئِيلاتٍ | ضَئِيلٍ | ضَئِيلَةٍ | ضَئِيلَيْنِ | ضَئِيلَتَيْنِ | ضَئِيلِينَ | ضَئِيلَاتٍ |فَعِيل |
      | ظمء | 4 | ظَمِئٌ | ظَمِئَةٌ | ظَمِئَانِ | ظَمِئَتَانِ | ظَمِئُونَ | ظَمِئَاتٌ | ظَمِئًا | ظَمِئَةً | ظَمِئَيْنِ | ظَمِئَتَيْنِ | ظَمِئِينَ | ظَمِئَاتٍ | ظَمِئٍ | ظَمِئَةٍ | ظَمِئَيْنِ | ظَمِئَتَيْنِ | ظَمِئِينَ | ظَمِئَاتٍ |فَعِل |
      | ظمء | 4 | ظَمْآنُ | ظَمْآنَةٌ | ظَمْآنَانِ | ظَمْآنَتَانِ |  |  | ظَمْآنَ | ظَمْآنَةً | ظَمْآنَيْنِ | ظَمْآنَتَيْنِ |  |  | ظَمْآنَ | ظَمْآنَةٍ | ظَمْآنَيْنِ | ظَمْآنَتَيْنِ |  |  |فَعْلان / فَعْلانة |
      | ظمء | 4 | ظَمْآنُ | ظَمْءَى | ظَمْآنَانِ | ظَمْءَيَانِ |  |  | ظَمْآنَ | ظَمْءَى | ظَمْآنَيْنِ | ظَمْءَيَيْنِ |  |  | ظَمْآنَ | ظَمْءَى | ظَمْآنَيْنِ | ظَمْءَيَيْنِ |  |  |فَعْلان / فَعْلَى |
      | عوج | 4 | أَعْوَجُ | عَوْجَاءُ | أَعْوَجَانِ | عَوْجَاوَانِ | عُوْجٌ | عُوْجٌ | أَعْوَجَ | عَوْجَاءَ | أَعْوَجَيْنِ | عَوْجَاوَيْنِ | عُوْجًا | عُوْجًا | أَعْوَجَ | عَوْجَاءَ | أَعْوَجَيْنِ | عَوْجَاوَيْنِ | عُوْجٍ | عُوْجٍ |أَفْعَل |
      | فرق | 4 | فَرِقٌ | فَرِقَةٌ | فَرِقَانِ | فَرِقَتَانِ | فَرِقُونَ | فَرِقَاتٌ | فَرِقًا | فَرِقَةً | فَرِقَيْنِ | فَرِقَتَيْنِ | فَرِقِينَ | فَرِقَاتٍ | فَرِقٍ | فَرِقَةٍ | فَرِقَيْنِ | فَرِقَتَيْنِ | فَرِقِينَ | فَرِقَاتٍ |فَعِل |
      | لءم | 5 | لَئِيمٌ | لَئِيمَةٌ | لَئِيمَانِ | لَئِيمَتَانِ | لَئِيمُونَ | لَئِيمَاتٌ | لَئِيمًا | لَئِيمَةً | لَئِيمَيْنِ | لَئِيمَتَيْنِ | لَئِيمِينَ | لَئِيمَاتٍ | لَئِيمٍ | لَئِيمَةٍ | لَئِيمَيْنِ | لَئِيمَتَيْنِ | لَئِيمِينَ | لَئِيمَاتٍ |فَعِيل |
      | وبء | 5 | وَبِيءٌ | وَبِيئَةٌ | وَبِيئَانِ | وَبِيئَتَانِ | وَبِيئُونَ | وَبِيئَاتٌ | وَبِيئًا | وَبِيئَةً | وَبِيئَيْنِ | وَبِيئَتَيْنِ | وَبِيئِينَ | وَبِيئَاتٍ | وَبِيءٍ | وَبِيئَةٍ | وَبِيئَيْنِ | وَبِيئَتَيْنِ | وَبِيئِينَ | وَبِيئَاتٍ |فَعِيل |
      | يسر | 4 | يَسِيرٌ | يَسِيرَةٌ | يَسِيرَانِ | يَسِيرَتَانِ | يَسِيرُونَ | يَسِيرَاتٌ | يَسِيرًا | يَسِيرَةً | يَسِيرَيْنِ | يَسِيرَتَيْنِ | يَسِيرِينَ | يَسِيرَاتٍ | يَسِيرٍ | يَسِيرَةٍ | يَسِيرَيْنِ | يَسِيرَتَيْنِ | يَسِيرِينَ | يَسِيرَاتٍ |فَعِيل |
      | يسر | 4 | يَسِرٌ | يَسِرَةٌ | يَسِرَانِ | يَسِرَتَانِ | يَسِرُونَ | يَسِرَاتٌ | يَسِرًا | يَسِرَةً | يَسِرَيْنِ | يَسِرَتَيْنِ | يَسِرِينَ | يَسِرَاتٍ | يَسِرٍ | يَسِرَةٍ | يَسِرَيْنِ | يَسِرَتَيْنِ | يَسِرِينَ | يَسِرَاتٍ |فَعِل |
      | يسر | 5 | يَسِيرٌ | يَسِيرَةٌ | يَسِيرَانِ | يَسِيرَتَانِ | يَسِيرُونَ | يَسِيرَاتٌ | يَسِيرًا | يَسِيرَةً | يَسِيرَيْنِ | يَسِيرَتَيْنِ | يَسِيرِينَ | يَسِيرَاتٍ | يَسِيرٍ | يَسِيرَةٍ | يَسِيرَيْنِ | يَسِيرَتَيْنِ | يَسِيرِينَ | يَسِيرَاتٍ |فَعِيل |
      | يسر | 5 | يَسِرٌ | يَسِرَةٌ | يَسِرَانِ | يَسِرَتَانِ | يَسِرُونَ | يَسِرَاتٌ | يَسِرًا | يَسِرَةً | يَسِرَيْنِ | يَسِرَتَيْنِ | يَسِرِينَ | يَسِرَاتٍ | يَسِرٍ | يَسِرَةٍ | يَسِرَيْنِ | يَسِرَتَيْنِ | يَسِرِينَ | يَسِرَاتٍ |فَعِل |
      | يمن | 5 | أَيْمَنُ | يَمْنَاءُ | أَيْمَنَانِ | يَمْنَاوَانِ | يُمْنٌ | يُمْنٌ | أَيْمَنَ | يَمْنَاءَ | أَيْمَنَيْنِ | يَمْنَاوَيْنِ | يُمْنًا | يُمْنًا | أَيْمَنَ | يَمْنَاءَ | أَيْمَنَيْنِ | يَمْنَاوَيْنِ | يُمْنٍ | يُمْنٍ |أَفْعَل |
